{
  "failed_count": 35,
  "failed_ids": [
    "T01n0091",
    "T01n0098",
    "T02n0112",
    "T03n0168",
    "T10n0284",
    "T12n0379",
    "T14n0443",
    "T14n0515",
    "T17n0764",
    "T17n0765",
    "T17n0841",
    "T18n0855",
    "T19n0978",
    "T19n0982",
    "T20n1121",
    "T21n1331",
    "T21n1341",
    "T21n1343",
    "T23n1442",
    "T24n1456",
    "T24n1463",
    "T24n1488",
    "T26n1542",
    "T28n1553",
    "T30n1580",
    "T31n1622",
    "T32n1638",
    "T32n1651",
    "T36n1739",
    "T43n1834",
    "T45n1866",
    "T45n1871",
    "T46n1921",
    "T48n2019B",
    "T85n2835"
  ],
  "details": {
    "T46n1921": {
      "sutra_id": "T46n1921",
      "title": "大正新脩大藏經",
      "author": "隋 灌頂撰",
      "volume": "46",
      "number": "1921",
      "juan": "5卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T46/T46n1921.xml",
      "total_chunks": 74,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA 蕭鎮國大德提供，北美某大德提供 原書標點 然論有序正流通。從初問佛經無量下去。至\n四月一＝至【甲】一【大】，至【甲】一至歲有三紙半。論文並是序分。從問觀\n自生心云何四不說下去。至寂然無言說有\n三十六行偈。是正說。從今約觀一念下去。\n〔有〕－【甲】有【大】，〔－〕【甲】有十行三字。是流通分。就初序分為二。一\n問二答。就問中為五意。一問佛經無量。二問\n論亦甚多。三問弘法之人詵詵蓋世。四問聽\n法之眾無處不有。五則＝即【甲】＊則【大】＊，即【甲】＊則即結問云。是則法雨普\n潤＝津【甲】潤【大】，津【甲】潤津利益無量。何所見聞更何利益而欲造論\n者耶。此之五意在於論初讀則可見。今不更\n\n釋。就第二答中為二。一長行略答。二偈中廣\n答。就長行略答為二。一者然可其二問云。佛\n經無量論亦甚多。此實如所問。故論云。是事\n共知也。二者正彈其三問為非。何者一正為\n弘法者多加水乳＝乳水【甲】水乳【大】，乳水【甲】水乳乳水故為失。二由弘者有過故。\n所以聽者失真道味。故復為失。三明由說者\n聽者有失故。所以四眾轉就澆醨佛法頹毀。\n為此三失悲傷而欲造論。意在於此也。何者。\n經云。諸法寂滅相不可以言宣。而今宣說者。\n欲使物藉宣通會理而反本。但佛經義隱文\n玄。所以菩薩作論申之。令稟教之徒得月忘\n指。研心諦理。故於不可說之中。備宣諸法而\n令諸律法禪等之三師乖違聖旨。非但不能\n光顯三寶。乃更污辱佛法。故像法決疑經明\n三師破佛法也。問三師有過耶。答略各有十\n過。法師十者。一但外求文解而不＋（報）【甲】不【大】，不報【甲】不不報內觀修心。\n釋論云。有CBETA 按：「聞文」二字，對校《永樂北藏》本（P167n1657_p0616a09）及《嘉興藏》本（J04n0084_p0047a25）同作「聞文」，他校《高麗藏》本《宗鏡錄》（K44n1499_p0259c06）及國圖本《冥樞會要》（D56n8980_p0100a05）作「論」，《卍續藏》本《涅槃經疏三德指歸》（X37n0662_p0310b21）作「聞」。〔聞〕－【甲】聞【大】，〔－〕【甲】聞文而無慧。所說不應受。二不\n融經息諍趣道。但執己非他。我慢自高。不識\n見心苦集。三不遵遺囑不依念處修道。不依\n木叉而住非佛弟子。四經云。非禪不慧偏慧\n不禪一翅一輪豈能遠運。五法本無說說破\n貪求。但名利弘宣寧會聖旨＝肯【甲】旨【大】，肯【甲】旨肯。六貴耳入而口\n出何利於己。經云。如人數他寶自無一錢分。\n七無行而宣何利於他。八多加水乳無道之\n教。教誤能生。九四眾失真法利。轉就澆醨。十\n非止不能光顯亦＝但【甲】亦【大】，但【甲】亦但乃破佛法也。禪師十者。一\n經云。假名阿練若。納＝衲【甲】納【大】，衲【甲】納衲衣在空閑。自謂人間\n寶道說我等過。二者恃行凌＝陵【甲】凌【大】，陵【甲】凌陵他不識戒取苦\n集煩惱。三無慧修定盲禪無目。寧出生死。四\n\n不遵遺囑不依念處。修道不依木叉而住非\n佛弟子。五無慧之禪多發鬼定。生破佛法死\n墮鬼道。六名利坐禪如扇提羅死墮地獄。七\n設證得禪即墮長壽天難。八加水乳禪教授\n學徒紹三塗種也。九四眾不沾＝沽【甲】＊沾【大】＊，沽【甲】＊沾沽真法之門＝潤【甲】門【大】，潤【甲】門潤。\n轉就澆醨＝離【甲】＊醨【大】＊，離【甲】＊醨離。十非止不能光顯三寶。亦乃破佛\n法也。律師十者。一但執外律不識內戒。故被\n淨名所呵。二執律名相諍計是非。不識見心\n苦集。三然戒定慧相資方能進道。但律不慧\n不禪何能進道。四弘在名譽志不存道果在\n三途。五不遵遺囑不依念處。修道不依木叉＝刃【甲】＊叉【大】＊，刃【甲】＊叉刃\n而住。六執律方便小教以為正理。而障大道。\n七師師執律不同弘則多加水乳。八不依聖\n教傳授則即誤累後生。九四眾不沾沽真法。轉\n就澆醨離。十非止不能光顯三寶。亦乃破佛法\n也。然晚生莫不軌崇三師。以為良導師。既邪\n而無道弟子何能自正。故經云。三師破佛法\n也。偈云。大師將涅槃慈父有遺囑。四念處修\n道當依木叉刃往＝住【甲】往【大】，住【甲】往住。此一偈明釋迦慈父令四\n眾依四念處修道。依木叉刃戒而住。故釋論明\n如來臨涅槃時。阿難請問佛云。如來滅後諸\n比丘依何道行＝行道【甲】道行【大】，行道【甲】道行行道依何而住。佛答云。令依四念\n處修道依木叉刃戒而住。問諸佛入道法門無\n量云何唯令依念處木叉刃二法而住耶。答二\n〔法〕－【甲】法【大】，〔－〕【甲】法雖略而理含攝一切法門皆盡。故偏勸也。\n今略辨二行多含之相者何耶。四念處是慧\n性為目。木叉刃戒為足。經云。"
    },
    "T21n1331": {
      "sutra_id": "T21n1331",
      "title": "大正新脩大藏經",
      "author": "東晉 帛尸梨蜜多羅譯",
      "volume": "21",
      "number": "1331",
      "juan": "12卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T21/T21n1331.xml",
      "total_chunks": 86,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA, Punctuated text as provided by Jasmine 蕭鎮國大德提供，北美某大德提供，Jasmine 提供新式標點 新式標點 聞如是前行元明二本有灌頂七萬二千神王護比丘呪經第二聞如是： 一時，世尊遊於羅閱祇梵志丘聚，從\n是北上錍提山中天帝石室。 爾時，無數比丘\n各各馳走怱怱不安，如捕魚師布網捕魚、魚\n都馳散。世尊遙見無數比丘各各馳散擾擾\n不安，佛知而故問諸比丘言：「何故繞轉如是\n不樂，若魚畏網？」 比丘對曰：「我為魔所嬈在所\n不安，晝則遇諸賊盜、毒蛇、蚖蝮，及諸龍象、熊\n羆所嬈，不得定意求四道果。見惱如是，當奈\n之何？」 佛告（諸）＋比【三】＊比【大】＊，諸比【宋】＊【元】＊【明】＊比諸比丘：「勿生憂惱，當為汝說灌頂章句，百\n二十神王導從前後，為汝作護辟除邪惡，諸\n嬈害者不令得便，在所至到營衛佐人，獲善\n吉利萬邪皆伏。」 諸比丘喜聞佛所說，心開意\n解前禮佛足，長跪叉手，白佛言：「世尊！惟＝唯【三】＊惟【大】＊，唯【宋】＊【元】＊【明】＊惟唯願\n演說灌頂章句，擁護我等及未來世諸比丘\n輩，令得安隱，使入定行。」 佛告諸比丘：「我今為汝一一分明說灌頂章\n句百七十二大鬼神王名字，如是諦聽憶念，\n慎莫忘之也。」 諸比丘言：「諾。受教。」叉手靜聽。 佛\n言： 「神名道軻彌伽＝迦【三】伽【大】，迦【宋】【元】【明】伽迦羅移嘻隷。 「神名嘻隷殷錍阿羅錍。 「神名摩〔比〕－【三】比【大】，〔－〕【宋】【元】【明】比丘披賴兜呵賴＝頭【三】賴【大】，頭【宋】【元】【明】賴頭沙。 「神名翅拘梨因提隷比丘披。 「神名漚羅須彌者羅阿羅因。 「神名阿羅耶阿耆破者。 「神名耶勿遮坻錍移阿錍。 「神名漚那是陀漚彌提屠。」 佛告諸比丘：「此十八神王，護諸比丘及未來\n世諸比丘等，及護僧伽藍。」 佛見錍提山中諸\n比丘輩怱怱不安，晝則為盜賊惡人所惱，夜\n則為鬼神所困，及諸龍象熊羆虎狼之所驚\n怖，又為蠱毒所中。佛於是廣為諸比丘輩說\n是無上灌頂章句諸大鬼神名號，令諸比丘\n常獲安隱吉祥＝利【三】祥【大】，利【宋】【元】【明】祥利之福無諸禍害。 「神名闍梨摩訶闍梨。 「神名闍羅尼優佉目佉。 「神名沙波提阿知和知。 「神名那知鳩那知波那提。 「神名提我沙羅波提。 「神名阿那波提波那提。」 佛告比丘：「此十二神王護諸比丘，等＝浮【三】等【大】，浮【宋】【元】【明】等浮陀鬼神\n若人非人不敢嬈近，毒藥不中、不為水火焚\n漂，縣官盜賊不令得便，怨家債主不能剝奪，\n神王眷屬七百徒黨常為作護，辟除兇惡萬事\n吉祥。 「神名加＝迦【三】＊加【大】＊，迦【宋】＊【元】＊【明】＊加迦和尼摩訶加迦和尼。 「神名阿佉尼佉尼阿佉那。 「神名阿佉尼阿比羅慢＝曼【三】下同慢【大】下同，曼【宋】下同【元】下同【明】下同慢曼多羅。 「神名波陀尼波提梨伽。」 佛告比丘：「此十神王，護今現在及未來世諸\n比丘輩，不令五溫＝瘟【三】瘟【CB】【磧乙-CB】【宋】【元】【明】，溫【大】瘟QC032n0178_p0071a13溫瘟疫毒之所侵害。若為虐＝瘧【三】虐【大】，瘧【宋】【元】【明】虐瘧\n\n鬼所持，呼十神王名號之時虐鬼退散，自護\n汝身亦當為他說，使獲吉祥之福。 「神名摩呵留邏迦梨區＝漚【元】【明】區【大】，漚【元】【明】區漚惒。 「神名金洹陀越阿耨三菩。 「神名迦梨＝利【三】梨【大】，利【宋】【元】【明】梨利三耶摩訶阿輸＝呵輪【三】阿輸【大】，呵輪【宋】【元】【明】阿輸呵輪。 「神名拔＝跋【三】＊拔【大】＊，跋【宋】＊【元】＊【明】＊拔跋陀沙羅曼陀羅阿。 「神名迦柰國舍呵呵羅羅。 「神名沙沙陀＝陀沙【三】沙陀【大】，陀沙【宋】【元】【明】沙陀陀沙陀摩摩迦＝迦摩【三】摩迦【大】，迦摩【宋】【元】【明】摩迦迦摩迦。 「神名拔跋陀沙羅曼陀羅羅。 「神名惒惒伊伊＝伊惒伊惒【元】【明】惒惒伊伊【大】，伊惒伊惒【元】【明】惒惒伊伊伊惒伊惒耶耶呵呵＝耶阿耶阿【三】耶耶呵呵【大】，耶阿耶阿【宋】【元】【明】耶耶呵呵耶阿耶阿。」 佛告比丘：「此十六神王與其眷屬萬五千鬼\n神，擁護今現在及未來世諸比丘等。昔伊洹\n比丘為八十一億魔所嬈，誦此十六神王名\n字，諸魔眷屬顛倒墮落、匍匐離散，形體變化\n莫知藏匿。」 告諸比丘：「若有危厄恐怖之日，呼\n此神名即獲吉祥，諸神祐＝佑【明】祐【大】，佑【明】祐佑助辟除兇惡＝藏匿【宋】兇惡【大】，藏匿【宋】兇惡藏匿。 「神名阿波竭證證竭無多薩。 「神名嘻遲比遲沾波沾。 「神名波迦羅喉掕"
    },
    "T03n0168": {
      "sutra_id": "T03n0168",
      "title": "大正新脩大藏經",
      "author": "西晉 竺法護譯",
      "volume": "3",
      "number": "168",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T03/T03n0168.xml",
      "total_chunks": 3,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Xiao Po 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，小波提供新式標點 新式標點 聞如是： 一時，佛在舍衛國祇樹給孤獨園，（佛）＋告【三】告【大】，佛告【宋】【元】【明】告佛告\n諸比丘＝弟子【三】比丘【大】，弟子【宋】【元】【明】比丘弟子： 「昔者有（王）＋【三】〔－〕【大】，王【宋】【元】【明】王王名波【CB】【麗-CB】，婆【大】波K11n0210_p0373a04T03n0167_p0408b09婆羅㮈。王有一太子，\n字名墓沐魄，生有無窮之明，端正妙＝好【三】妙【大】，好【宋】【元】【明】妙好潔，無有\n雙比。父母奇之，供養瞻視，須其長大，當為立\n字。然太子結舌不語十有三歲，恬惔質朴，志\n若死灰，意如＝直若【三】意如【大】，直若【宋】【元】【明】意如直若枯木；目不視色，耳不聽音，狀\n類瘖瘂聾盲之人。於是父母患而厭＝苦【三】厭【大】，苦【宋】【元】【明】厭苦之。 「王\n語夫人：『當奈之何？此子將為他國所笑。』夫\n人語王：『當召相師相之，知當語不？』王即召\n婆羅門師，使相太子。婆羅門言：『此子非是世\n間人，為是熒惑耳。外為端正，內懷不祥；危\n國滅宗，將至不久。不可畜養，宜當生埋，誅而\n殺之＋（今）【三】之【大】，之今【宋】【元】【明】之之今。不除此子，則絕國嗣。』王語夫人：『當如\n之何？今〔若〕－【三】若【大】，〔－〕【宋】【元】【明】若不除此子＝之以往【三】此子【大】，之以往【宋】【元】【明】此子之以往，恐後無復立〔太〕－【三】太【大】，〔－〕【宋】【元】【明】太子。』\n於是夫人隨王所為。 「王即召國中大臣共議\n之。一臣言：『當遠徙深山無人之處。』一臣言：\n『當沒深水中。』一臣言：『但當隨師所語，掘作深\n坑而生埋之。』王即隨是一臣所語，即召外陣\n兵三＝二【三】三【大】，二【宋】【元】【明】三二千〔餘〕－【三】餘【大】，〔－〕【宋】【元】【明】餘人，使掘地作藏。給世＝三十歲【三】世【大】，三十歲【宋】【元】【明】世三十歲資糧，侍以\n\n五僕，太子衣服＝被【三】服【大】，被【宋】【元】【明】服被、瓔珞、珠寶＝寶蓋【三】珠寶【大】，寶蓋【宋】【元】【明】珠寶寶蓋盡還太子。於是\n夫人心欲＝用【三】欲【大】，用【宋】【元】【明】欲用傷絕：『我獨無相，生子薄命，乃＝反【三】乃【大】，反【宋】【元】【明】乃反值\n此殃，事不得止。』涕淚哽咽，不能自勝。 「於是復\n送太子著正殿上＝前【三】＊上【大】＊，前【宋】＊【元】＊【明】＊上前，五百夫人見太子端正姝\n好，無有雙比，皆言：『太子何以不語，而當生埋？』\n五百婇女見太子端正姝好，皆為太子作禮\n而言＋（太子）【三】言【大】，言太子【宋】【元】【明】言言太子：『何以不語，而當生埋？』（各）＋各【三】各【大】，各各【宋】【元】【明】各各各為太子作其伎＝唱伎【宋】，倡妓【元】【明】其伎【大】，唱伎【宋】，倡妓【元】【明】其\n伎唱伎倡妓樂。太子默然，不觀不聽。 「復＝於是直【三】復【大】，於是直【宋】【元】【明】復於是直送太子著外\n殿上前，五百大臣見太子端正姝好，無有雙比，\n前白大王：『太子非是不語〔之〕－【三】之【大】，〔－〕【宋】【元】【明】之人，且復＝小【三】復【大】，小【宋】【元】【明】復小宿留，\n語在不久。婆羅門言＝師【三】言【大】，師【宋】【元】【明】言師，不可審信。』王語大臣：\n『此是國事，非卿所知。』 「作藏已＝以【三】已【大】，以【宋】【元】【明】已以訖，來迎太子。\n王語其僕：『使太子載〔我〕－【三】我【大】，〔－〕【宋】【元】【明】我四望象車，令國中\n人民就觀，太子當＝儻【三】當【大】，儻【宋】【元】【明】當儻語。若＋（其）【三】若【大】，若其【宋】【元】【明】若若其語者，便＝更【三】便【大】，更【宋】【元】【明】便更載來還。』於\n是太子乘＝昇【三】乘【大】，昇【宋】【元】【明】乘昇車尋路。國中耆舊大臣皆宛轉車\n前而言：『太子！要當一語。若不語者，便以車輾\n我上過〔去〕－【三】去【大】，〔－〕【宋】【元】【明】去。』遮蠡虎賁扶避使過。遂侍＝將【三】侍【大】，將【宋】【元】【明】侍將太子遂到＝到其【三】遂到【大】，到其【宋】【元】【明】\n遂到到其藏所。時有數千萬人，皆隨＝送【三】隨【"
    },
    "T32n1638": {
      "sutra_id": "T32n1638",
      "title": "大正新脩大藏經",
      "author": "善寂菩薩造  宋 施護譯",
      "volume": "32",
      "number": "1638",
      "juan": "2卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T32/T32n1638.xml",
      "total_chunks": 8,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by SAT, Japan, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，日本 SAT 組織提供，北美某大德提供，李明芳大德提供新式標點 新式標點 歸命一切佛，歸命諸法藏，頂禮一切智，廣大\n\n甚深理。我今造論，名曰寶上，是諸法中最上\n真實決定勝義。 論曰：若人若天及諸情類，從\n無始來癡暗為因，有語言道是惡趣根。若有\n樂入彼一切智清淨界者，是故歸命佛曰光\n明。此中云何所謂離我等性及一切因？當知\n一切煩惱業生雜染等法，無初無住而無實\n體，雖有所生與夢幻等，如夢幻故從分別起。\n當知諸法皆從緣生，是故諸佛緣生義中，宣\n說諸法諸物性空、空無自性，而亦不應於中\n作無實想。是故清淨阿賴耶識，雖有所受而\n無所著，此義甚深又復廣大，諸經教中皆如\n是說。諸有樂欲求解脫者，應當如實覺了諸\n法。當知諸法不離於識，若離識者是性即斷，\n是故法中無實有性。《法集經》中作如是說。 若法是實、若法不實，若有自性、若無自性，是\n二不應將幻喻等，諸法非有性而亦非無性。\n此中所說若實無性，無性名空，空即成斷。若\n實有性，是性為常。當知言空與非空異，離空\n非空亦無所得。又如明暗二不相合，離暗離\n明俱無所得。是故應知，此中所說明不現前\n暗云何離？智之與愚二不相合，離智離愚亦\n無所得，非智非愚是二中間我想皆空。彼一\n切法無內無外亦無中間，無法可取、無法可\n捨。《寶積經》中作如是說。 若說言有此為一邊，若說言無是為二邊，若\n一若二若彼中間，皆無有相而不可見，無相\n見故亦不可說。無形無像不可表示，無種類\n法無所攝藏，亦非中邊有所安立，此中所說\n是真實說。性與無性本來如是，作此解者\n\n真觀聖諦，能離貪等煩惱過失。設復煩惱有\n所生起，於聖諦中而無所著。若如是知如是\n解者，即得如來功德聚身，作師子吼轉大法\n輪，普令一切皆悉見聞。《楞伽經》中作如是\n說。 我語無相而不可取。《轉識經》中作如是說。 離識有法理不相應。《授記經》中作如是說。 當知識心遍一切法。《十地經》中作如是說。 色法無實不可取捨。《那耨俱梨經》中作如是\n說。 若了諸法性，即非智所知，是故此中無實可\n得，智體無實當知如幻。諸經教中作如是說。 諸菩薩者隨諸相轉，是相無實義、無所得，勝\n義諦中言不可立。《寶雲經》中作如是說。 若本是無，不可言有。識離分別，名不可立。彼\n勝義諦真理離言，而諸物性實無所得，此如\n是說是決定語，佛所說意破諸無智。《現愛經》\n中作如是說。 若言有物是為空者，眾生業報應有染淨，若\n有染淨即是有作，若有所作即種種相隨世\n間轉，有相轉故見有所成。若能安住無顛倒\n想，即知物性無別實體。此如是義者，慈氏菩\n薩問、世尊如實說。我本無邊，菩提亦無邊，菩\n提無邊故無菩提可得。我無邊故無求菩提\n者，亦無少法是智所知。唯諸佛智而能照了，\n彼真如法即是無性，無性即是如來，如來者\n即是無生性。《颯鉢多設多經》中作如是說。 彼一切法若說言有，此為常語；若執為無，即\n成斷見；若非有非無，又中間不立。《寶星經》中\n\n作如是說。 貪等煩惱一切染法若解脫者，是無盡相。若\n能了知煩惱自性本來清淨，勝義諦中脫無\n所脫。若欲真實觀如來者，當觀如來解脫所\n生，不從因生、不從緣生，非有相生、非分別生，\n遠離一切名言差別，非色相非色真如，乃至\n非識相非識真如，非晦非明、非即非離、非見\n非知，離諸識法非所了別，不於一切識法中\n住。若能如是觀如來者，名為正觀；若他觀\n者，名為邪觀。以邪觀故，彼不能見如來真實。\n此中所說如實義者，離有離無、非性非無性，\n如是名為真見如來。《無垢稱經》中作如是說。 《華嚴經》中，有一天子【CB】【麗-CB】，下【大】子K40n1430_p0371a14下，問妙吉祥菩薩言：云何\n實語、不實語？一切煩惱云何調伏？妙吉祥答\n言：如人夢中見彼大蛇，是人雖見，非毒所害。\n煩惱雖生而無實性，是性清淨而自調伏。此\n為實語，非不實語。 又海慧菩薩問不思議梵天言：法本無證及\n無所說，云何有佛及諸佛法？不思議梵天答\n言：若佛如來出興於世，及彼演說諸佛法分，\n若有若無本自如是，本來無說亦無所證。無\n說故無聞，無證故無得，但為眾生煩惱業生\n諸果報性，引生諸佛大菩提心，住諸菩薩悲\n心境界。若諸"
    },
    "T20n1121": {
      "sutra_id": "T20n1121",
      "title": "大正新脩大藏經",
      "author": "Unknown",
      "volume": "20",
      "number": "1121",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T20/T20n1121.xml",
      "total_chunks": 1,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，北美某大德提供，李明芳大德提供新式標點 新式標點 如上名願菩提心 唵薩嚩喻誐質多母答跛二合那夜弭 大歷三年八月十四日西京青龍寺僧願力\n書寫梵漢字記 應德元年九月二十八日辰剋於桂林房以\n前唐院唐本傳寫了件唐本千手儀軌在諦\n耳良　記之"
    },
    "T12n0379": {
      "sutra_id": "T12n0379",
      "title": "大正新脩大藏經",
      "author": "隋 闍那崛多譯",
      "volume": "12",
      "number": "379",
      "juan": "3卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T12/T12n0379.xml",
      "total_chunks": 23,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Punctuated text as provided by Mao Pei-Jun and Liao Yu-An, Others 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，毛佩君、廖予安大德提供新式標點，其他 新式標點 （哀泣品第一）品名＋如是【三】【宮】【聖】（哀泣品第一）品名＋如是【宋】【元】【明】【宮】【聖】如是哀泣品第一如是我聞： 一時婆伽婆在俱尸那國力士居\n地娑羅林所明註曰二南藏作一二一雙樹間。爾時，如來思惟：「今日\n涅槃時到，應當取滅。」 長老阿難即於其夜欻\n得惡夢，驚怖憂惱，馳向佛所，愁慘合掌，瞻仰\n世尊，目不暫捨。 爾時，佛告長老阿難：「瞿曇彌\n子！何故如是熟視於我，眼不暫瞬？」 爾時，阿難\n即白佛言：「世尊！我於昨夜忽然見夢＝夢見【三】【宮】見夢【大】，夢見【宋】【元】【明】【宮】見夢夢見，身毛\n為竪，甚大怖懼，必是如來涅槃先相。世尊！我\n既見是非吉夢已，心無情賴，深生憂惱，恐畏\n世尊速入涅槃。」 佛告阿難：「瞿曇彌子！汝【CB】【麗-CB】，故【大】汝K09n0109_p0471a14T12n0379_p0929a02故見何\n夢，知是如來涅槃先相，而生驚怖？」 爾時，如來\n\n即以此偈問阿難曰： 爾時，阿難即以偈頌白世尊曰： 爾時，淨居諸天子及娑婆世界主、大梵天王、\n并商主魔王子、天主憍尸迦、四天王等，并諸\n眷屬，各於住處聞佛世尊涅槃之相，各及八\n十餘那由他眷屬諸天子等，前後圍遶，往詣\n佛所，頂禮佛足，皆悉同聲，悲號懊惱，憂愁泣\n淚。即向阿難而說偈言： 爾時，世尊向慧命阿難及諸天眾而說偈言： 爾時，世尊如是說已，慧命阿難即以偈頌白\n世尊曰： 佛告阿難＋（曰）【三】【宮】【聖】難【大】，難曰【宋】【元】【明】【宮】【聖】難難曰：「瞿曇彌子！汝莫憂苦，諸行性＝法【三】【宮】【聖】性【大】，法【宋】【元】【明】【宮】【聖】性法相\n悉皆無常。」爾時，世尊即說偈言： 爾時，慧命阿尼婁陀樓䭾婁䭾在須彌山頂為三十三\n天正當說法。是時，即以清淨天眼過於人眼\n觀見大威德諸天子等捨於宮殿，復聞諸天\n叫喚，大聲悲號啼哭，復見己【CB】，已【大】己已之徒眾眷屬悉\n皆四散。 時阿尼婁陀樓䭾婁䭾正念甚深，天眼之明，\n重復觀察諸天子等各及眷屬，捨己【CB】，陀【大】己陀欲樂，憂\n悲苦惱，速疾捨離，相續而去。 時阿尼婁陀樓䭾婁䭾更\n復觀見須彌山王及諸山峯——或高百由旬或\n二百由旬、三百由旬、四百由旬——摧剝崩倒，或\n五百由旬，或復無量須彌山峯，崩倒墮落大\n海水中，於彼眾生無所損惱，亦無傷害。尚不\n損惱於一眾生，況多眾生？亦不傷害於一眾\n生，況當傷害於多眾生？彼須彌山王所有依\n住天、龍、夜叉、乾＝揵【三】【宮】乾【大】，揵【宋】【元】【明】【宮】乾揵闥婆、阿修羅、緊那羅、摩睺羅\n伽，聞於如來欲入涅槃，悉皆憂悲，生大苦惱，\n同時趣向俱尸那城，速疾急行。當速行處，須\n彌山峯而自崩倒，音響震動，並出聲言：「今大\n釋種釋迦牟尼，釋中勝王，於阿僧祇億劫苦\n行，修諸善根，今於力士所生之地，娑羅林所\n在雙樹間，欲入無餘寂滅涅槃。諸天人等皆\n當眼滅。」彼皆怱遑，速疾而行，大須彌山及大\n海水皆悉撓＝擾【三】【宮】撓【大】，擾【宋】【元】【明】【宮】撓擾動。以是事故，此大須彌山王之\n峯及大山谷崩倒墜落，沒入大海。 爾時，阿尼\n婁陀樓䭾婁䭾正住須彌山頂，即發大聲而說偈言： 爾時，尊者阿尼婁陀樓䭾婁䭾說此偈已，以佛神力，閻\n浮提內所有比丘、比丘尼、優婆塞、優婆夷——惟＝唯【三】【宮】惟【大】，唯【宋】【元】【明】【宮】惟唯\n除上座摩訶迦葉及諸弟子徒＝彼【元】【明】徒【大】，彼【元】【明】徒彼眾眷屬——自餘\n二百四比丘眾、諸餘所有四部眾等，馳趣＝聚【元】【明】趣【大】，聚【元】【明】趣聚娑\n羅雙樹林間，同來聚集，禮世尊足，各作是念：\n「我等今者即是最後覲見世尊。」 時阿尼婁陀樓䭾婁䭾\n說是偈已，應時三千大千世界所有大威德諸\n天人等，及諸天天子、天女，諸龍龍子、龍女，及\n諸夜叉、夜叉男女，毘舍遮、毘舍遮男女，一切\n諸天人、阿修羅、迦樓＝婁【聖】樓【大】，婁【聖】樓婁羅、緊那羅、摩睺羅伽、人\n非人等，星宿行處。如是等一切大眾皆悉號\n咷，流血灑地，面淚滿目，心皆迷毒，叫＝別【聖】叫【大】，別【聖】叫別喚舉聲，\n哀慟大吼，駭動天地。憂箭所射心無情賴，惋\n歎感傷喐吚諮嗟，諸根悲塞頓悶斷絕，宛轉\n\n于地舉身戰＝顫【三】【宮】戰【大】"
    },
    "T17n0841": {
      "sutra_id": "T17n0841",
      "title": "大正新脩大藏經",
      "author": "唐 智嚴譯",
      "volume": "17",
      "number": "841",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T17/T17n0841.xml",
      "total_chunks": 2,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Ms. Huang Jin-Ai 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，黃金愛大德提供新式標點 新式標點 如是我聞： 一時佛在法界藏殿諸佛所會無\n邊道場，與大比丘眾、菩薩摩訶薩俱。時此道\n場有一夫人，名曰功德莊嚴開敷花，合掌向\n\n佛退坐一面。 爾時夫人白佛言：「若有初修行菩薩，何等之\n人非善知識不應共住？」 佛告夫人：「若三界中\n梵、釋、四王、沙門、婆羅門，皆與修行菩薩為善\n知識，惟＝唯【三】【宮】惟【大】，唯【宋】【元】【明】【宮】惟唯除聲聞非善知識（恐聲聞退修行菩\n薩大乘道行）。何以故？聲聞、緣覺為己利故，勸\n引初修行菩薩迴入小乘，是以聲聞乘人非\n善知識。夫人當知，初修行菩薩不應與聲聞\n比丘同居房舍，不同坐床、不同行路。若初修\n行菩薩智慧彌廣，無二分別悟大乘法，而為\n方便勸引聲聞令入大乘，方許同住；若聲聞\n比丘福智狹劣，則修行菩薩不應為說甚深大\n乘，恐其誹謗。復次修行菩薩不應數覽小乘\n經論。何以故？為障佛道故。夫人當知，修行菩\n薩寧捨身命，不棄菩提而入聲聞求羅漢道。\n菩薩勸請一切眾生已，爾時若捨菩提之心，\n別起異道入於聲聞羅漢道果，因惱亂故菩\n薩而退菩提，二人俱墮無間地獄。」 佛告夫人：\n「修行菩薩寧犯殺等五種大罪，不學須陀洹\n果，不退菩提修行；菩薩寧於一劫百劫乃至\n千劫受地獄苦，不學斯陀含果，不退菩提修\n行；菩薩寧墮畜生，不學阿那含果，不退菩提\n修行；菩薩寧殺害眾生墮於地獄，不修阿羅\n漢果，不退菩提。羅漢獨證＝覺【明】【宮】證【大】，覺【明】【宮】證覺私入涅槃，譬如\n小賊密入他舍。修行菩薩菩提心故攝諸眾\n生，寧同火坑不住聲聞寂滅涅槃，不退菩提，\n以是義故，為攝眾生令入佛道故。如是修行\n菩薩，一切世間天、人、阿修羅之所尊重，堪任\n供養超越聲聞，則邪魔眷屬無能嬈惱＝嬈亂【宮】嬈惱【大】，嬈亂【宮】嬈惱嬈亂。」 爾時夫人白佛言：「何者邪魔眷屬？」 佛告夫人：\n「敷演大乘經典之處，若有眾生聞說大乘，心\n不樂聞、調弄誹謗，當知則是邪魔眷屬。誹謗\n大乘經典心故，死墮阿鼻受苦無量，復生餓\n鬼食火＝大【明】【宮】火【大】，大【明】【宮】火大屎尿，無量劫中受苦畢已，後生人中，\n盲聾、瘖瘂、病癩、不具。此等眾生命終之後，經\n無量生方得值遇如來親承供養，於諸佛所\n還復得聞大乘經典，純一無雜。」 爾時如來\n於諸毛孔普出言音，一一毛孔出無量億百\n千法光，復生無量法音偈讚。時此會中若有\n聲聞＋（乘人）【三】【宮】聲聞【大】，聲聞乘人【宋】【元】【明】【宮】聲聞聲聞乘人則聞聲聞乘法；若有緣覺乘人則聞緣\n覺乘法；若有大乘行人則聞大乘妙法；鳥狩＝獸【三】【宮】狩【大】，獸【宋】【元】【明】【宮】狩獸\n之類各隨其音而聞佛法。於此會中所有眾\n生，過去未曾耳聞佛法，皆見如來默然不語；\n其餘眾生過去曾謗大乘經故，雖於多劫墮\n在地獄、餓鬼受苦，由謗法時大乘入耳，是故\n佛所親聞大乘心生歡喜，而發無上菩提之\n心，究竟成就阿耨多羅三藐三菩提。 爾時夫人白佛言：「所說大乘，何故名為大乘？\n何故說為大乘？」 佛言＝告【三】【宮】言【大】，告【宋】【元】【明】【宮】言告：「夫人！善哉善哉！夫人\n深樂大乘，以是義故，善思念之，當為汝說大\n乘名號。所謂：一者、令人深樂，是名大乘。二者、\n不動，是名大乘。三者、無過，是名大乘。四者、\n無量＝無邊【三】【宮】無量【大】，無邊【宋】【元】【明】【宮】無量無邊，是名大乘。五者、如四大海，是名大乘。\n六者、金翅及緊那羅、摩睺羅伽雜類所敬，是\n名大乘。七者、乾闥婆所讚，是名大乘。八者、諸\n天恭敬，是名大乘。九者、梵天歸依，是名大乘。\n十者、天帝所敬，是名大乘。十一者、四王所攝，\n是名大乘。十二者、龍王供養，是名大乘。十三\n\n者、菩薩奉持，是名大乘。十四者、成就佛性，是\n名大乘。十五者、賢聖歸依，是名大乘。十六者、\n一切普堪所受，是名大乘。十七者、如藥樹王，\n是名大乘。十八者、斷諸煩惱，是名大乘。十九\n者、能轉法輪，是名大乘。二十者、無言無說，是\n名大乘。二十一者、如虛空相，是名大乘。二十\n二者、三寶種性無斷，是名大乘。二十三者、鈍\n根眾生不信，是名大乘。二十四者、超過一切，\n是名大乘。」 爾時佛說大乘威力名號之時，此三千大千\n世界六種震動"
    },
    "T85n2835": {
      "sutra_id": "T85n2835",
      "title": "大正新脩大藏經",
      "author": "唐 慧光釋",
      "volume": "85",
      "number": "2835",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T85/T85n2835.xml",
      "total_chunks": 6,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA 蕭鎮國大德提供，北美某大德提供 原書標點 夫大道融心顯實一理。前後賢聖唯趣此門。\n悟者三界唯心。不悟隨眠□□□乘宗定對\n相顯。真了悟者知諸法寂然因緣立事假合\n成名。不了者著名住字取想奔耶。若欲攝妄\n歸真染淨平等者。要須注意觀心。本覺自現。\n意觀有力。仍不出意念到彼岸。常入甚深禪\n定。久習不已。自然事是皆畢。若觀處有事\n漸漸向真。縱放身心虛豁其壞。起作恒寂不\n像而照。任運三昧溫道育德。資成法。身返悟\n心源無妨無礙。體若虛空名無邊三昧。心無\n出入名無寂三昧。於一切有處淨無求名不\n思議三昧。三昧不昧不從緣起名法性三昧。\n一切學者但求其解不求自證。若欲修習大\n乘者。不解安心定知悟失。時有居士。俗性\n李名惠光。是雍州長安人也。法名大照。不顧\n榮利。志求菩提。前事安闍梨。後事會和尚。皆\n\n已親承口決蜜授教旨。至於精義妙理達本\n窮源。出有入無圓融自在。居士乃禪思餘暇\n歎此群迷。遂顯事理幽門。諮呈妙義開斯法\n要。可謂涉海之舟船直往菩提。斯言信矣。庶\n將未悟者願令得悟。未安者願令得安。未解\n脫者願令解脫。 居士問曰。佛法幽玄凡人不惻。文字浩汗意\n義難知。請問禪師法要暫辭方便。直往直言\n不棄俗流。幸無祕密　大照禪師答。善哉善\n哉觀汝所問。菩薩根基似欲純熟。吾長身四\n十有五。入道已來二十有餘。未曾有人問斯\n意義。汝有何事復決何疑。直問直說不假煩\n言　問曰。夫欲入道者當修何法看何法證\n何法求何法悟何法得何法而趣菩提　答曰。\n一法不看亦無有求。一法不證亦無有後。一\n法不悟亦無道可修。即是菩提　問曰。弟子\n無始世來流浪生死。與理相違。乍聞頓說冥\n漠不知。神識昏昏莫知所在。由若醉人未能\n星悟。伏願下接群迷賜垂少問。方便會真\n　問曰。云何真性　答曰。不起心常無相清淨\n　問曰。云何自性　答曰。見聞覺知四大及\n一切法等各有自性　問曰。自性從何而生\n　答曰。從妄心生　又問曰。云何離自性\n　答曰。心不起即離　問曰。云何是道。云何是\n理。云何是心　答曰。心是道。心是理。則是心\n心外無理。理外無心。心能平等名之為理。理\n照能明名之心。心理平等名之佛心。得此理\n者不見生死。凡聖無異。境智無二。理事俱融。\n染淨一如。如理真照。無非是道。自他俱離。一\n\n切行一時行。亦無前後亦無中間。縛解自在。\n稱之道　問曰。云何順正理人　答曰。心不\n起常無相順　問曰。云何順道　答曰。直心\n不著一切即順　問曰。云何是妄　答曰。不\n識自心是妄　問曰。云何是顛倒　答曰。若起\n種種境界是顛倒　問曰。何者是自心。何者\n是妄心　答曰。若行分別是妄心。不分別是自\n心　問曰。分別心及不分別心從何而生\n　答。分別心從顛倒生。不分別心從正智生\n　問曰。分別心及與不別心俱從何生　答曰。\n無我生處　問曰。既生處云何稱有顛倒稱有\n正智　答。若不識自心即行種種顛倒　若識\n自心即是正智　問曰。今言識與不識俱從\n何而生　答。若識從悟生。若不識從妄想生\n問曰。一切眾生總在妄想。為復亦在正智\n　答曰。一切眾生無在正智。實無妄想　問曰。\n我今現在妄相云何稱有正智　答曰。汝本\n來實無妄想。今稱妄想。即如人食莨蕩子於\n空中覓針。如此虛空實無有針　問曰。本來\n既無妄。今一切行人斷何物而求道乎　答\n曰。不斷一物亦無道可求　問曰。既無道可\n求。無物可斷。云何世尊經文說斷妄想　答\n曰。世尊實不遣斷妄想。若斷妄想者即不離\n妄想一切眾生妄有所得妄有所斷妄見有妄\n想法。世尊隨眾生意說假立妄想法。世尊實\n不說一字妄想法。譬如艮鑿對病說藥。若無\n有病即不說藥　問曰。既是世尊不說妄想\n法。其妄想何誰造作　答曰。眾生自造作。正\n智即無　問曰。云何不造正智。偏造作妄想\n\n答曰。不識正智即有妄想。若識妄想　問曰。\n既有正智。即合有妄想。云何說稱無妄想\n　答曰。眾生實無妄想。亦無正智。二俱不可\n得　問曰。既二俱不可得。即合無有凡夫亦\n無聖人　答曰。亦有凡亦有聖。汝自不識\n　問曰。何者是凡何者是聖　答曰。汝若\n分別即是凡夫。若也不分別即是聖　問曰。\n分別是凡。不分別是聖。如小嬰兒長頭不\n分別。可是聖人乎　答曰。作此見解大是\n愚夫。准如嬰兒幼稚不識好惡。由如癡人\n不識尊卑。豈得是不分別會。須於真如理\n中常行分別心得無分別智　問曰。作勿生\n即是不分別智　答曰。汝且看處看淨心看\n心起處。即須覺知心從本已來清淨。不被外\n緣所染。事須了了見。因緣性不可得。即知因\n緣亦空亦非空者。即是世間所有森羅萬像\n君臣父母人義禮信。此即是世間法不壞。是\n故經文不壞世法而入涅槃。若壞世"
    },
    "T21n1341": {
      "sutra_id": "T21n1341",
      "title": "大正新脩大藏經",
      "author": "隋 闍那崛多譯",
      "volume": "21",
      "number": "1341",
      "juan": "20卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T21/T21n1341.xml",
      "total_chunks": 169,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，北美某大德提供，李明芳大德提供新式標點 新式標點 如是我聞： 一時婆伽婆在舍婆提大城祇樹\n給孤獨園，與大比丘眾千二百五十人俱。復\n有無量天、龍、夜叉、乾闥婆、阿修羅＋（迦樓羅）【三】羅【大】，羅迦樓羅【宋】【元】【明】羅羅迦樓羅、緊那羅、摩\n睺羅伽、人非人等四部大眾左右圍遶。爾時\n世尊告長老阿難言：「阿難！有陀羅尼法本，過\n去諸佛已曾顯示略廣解釋，為諸侍者及以\n眾生受安樂故、憐愍世間諸天人等廣利益\n故。我今亦欲說此陀羅尼，亦令眾生受安樂\n故、哀愍世間諸天人等廣利益故。阿難！汝既\n是我親承侍者，我今為汝說此法本。諦聽諦\n受，善思念之，當為汝說。」爾時阿難而白佛言：\n「唯然世尊！願樂欲聞。」 佛告阿難：「一者神通、二者根本；又復一者\n是欲具足、二者見具足，不入涅槃，所謂斷見\n及以常見。復有二見不入涅槃，謂於我見煩\n惱著見，以一智者而言無智。復次應知俗事\n及與執著世俗言詞，應知事及與非事，應知\n有為事及無為事，應知生、應知滅，則應知入\n處、應知非入處，應知去處、應知斷去處、應知\n處所，應知愛、應知愛因緣、應知境界道，應\n知發去處、應知入處、應知至處去勝，應知別\n離、應知別離住處，應知攝非事、應知非義語、\n應知聚集事，應知緣、應知緣住處、應知緣\n和＝合【三】和【大】，合【宋】【元】【明】和合、應知緣生處、應知緣生、應知緣所生法，\n\n應知行、應知勝行，應知住國土處善根、應知\n攝閑預成就、應知得閑預分、應知得佛出世\n善根，應知作防護事、應知信欲減、應知閑處，\n應知一自在、二分別生、三種得因緣，應知三\n學行、二種淨戒、三種聖教、一愛著瞋恚、一真\n實謂如來教、一朋友不可破、一伴可共入怖\n處、一切眾生自在非善知識、一切眾生具自\n在難不信發行、一切眾生本性破壞、一切眾\n生共同一行、一切眾生不得愛故與愛為奴、\n一切眾生自過不見故不入涅槃、一切眾生\n各相障礙不得解脫、一善根不能斷故入般\n涅槃。興造諸業而不失壞，入一欲故入惡處，\n入二三四五欲故入地獄中。一種不欲、一種\n印、二種觀察、一種勇健、一道七處、五破壞、\n五力、五語道處、五世間法、五生趣、五聚陰、\n五病、五無病、五根、五時、五三摩耶分、五摩\n呼多、五最後心生處持來、五不勝法、五儜怯、\n五優婆塞、五種多貪性、五種宰官、五無量、五\n勝作、五戲論、五恐怖、五怨讎、五不共心分、\n五不敬、五尊重、五重、五擔＝誓【三】擔【大】，誓【宋】【元】【明】擔誓、五怖畏、五宰官\n和合、五種滅依身、五種滅依口、五種滅依意、\n五種想因緣、五受、五受斷、五暗、五暗盲、五\n翳障眼、五羅剎、五淵、五迴轉、五窟、五窟斷、\n五分第一禪、五種聲、五種世法行、五種共\n法舉罪、五教示、五善知識教、五種言說法音\n生處、五種論法、五喜根、五喜生處、五憂生\n法、五怯弱怖畏應當解說、五種功能應當解\n說、五種世間功德行、五種漏法和合、五種勝\n世行、五種觸生、五種惡道、五種惡眼、五種惡\n\n耳、五種惡鼻、五種惡舌、五種惡身、五種惡\n意、五無功德法、五種獨住持因緣、五種離教\n師隨緣流轉、五種法應隨順眾、五受因緣、五\n受不斷滅、五法當作憂、五痛著不遍知故受\n苦痛、五種蓋不可取、五種障分別、五一向\n行法不應取、五種事物應當離、五相不斷滅、\n五乾燥無因起、五作惡處滿、五種烟、五奸猾\n欺誑言說、五種賊長命難打、五作時行、五種\n眾生塚間平等、五種在空處因緣、五窟處不\n恐怖隨心所欲、五嚴熾不作惡、五巧行境界\n處、五無中間、五法不作別異、五住處、五惡住\n處、五種得錢物得宿命得念智現證見巧因\n緣隨轉、五無毒、五濕波耶那、五善根大果報\n隨轉、五功德捨法、五懶惰＝墮【宋】【元】＊，惰【明】＊懶惰【大】＊，墮【宋】【元】＊，惰【明】＊懶惰墮惰事、五信滿、五法\n具足當入正位、五根前受業報、五種智聚欲\n滿隨轉、五時施善根成熟增長、五施當減諸\n有、五種戒超越、五道滿足、五戒俱善覆護滿\n足、五種戒當轉法輪、五戒〔俱〕－【三】俱【大】，〔－〕【宋】【元】【明】俱具足已得四\n十種歡欣法，五種戒俱受已羸劣戒不具足\n缺減破戒，謂優婆塞優婆夷五種刺患，命終\n時得五種行巧解脫當具足滿。五中等邊、五\n種戒羸、五戒句顛倒行無有別異、五戒羸當\n為說、五戒俱當轉十二相法輪、五種時一法\n時、五種言一法言、五種眾一眾會、五種道\n一善妙、五命終一是斷、五智者一最勝、五境\n界我歎一、五道無別異相"
    },
    "T45n1871": {
      "sutra_id": "T45n1871",
      "title": "大正新脩大藏經",
      "author": "唐 法藏述",
      "volume": "45",
      "number": "1871",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T45/T45n1871.xml",
      "total_chunks": 14,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA 蕭鎮國大德提供，北美某大德提供 原書標點 夫以。主教圓通盡虛空於塵剎。帝珠方廣攬\n法界於毫端。無礙鎔融盧舍那之妙境。有崖\n斯泯普賢眼之玄鑒。浩汗微言實叵尋其旨\n趣。宏深法海尤罕測於宗源。今略舉大綱開\n茲十義。撮其機要稱曰旨歸。庶探玄之士粗\n識其致焉。 一說經義　二說經時　三說經佛\n　四說經眾　五說經儀　六辯經教\n　七顯經義　八釋經意　九明經益\n　十示經圓 夫圓滿教起必周側於塵方。既為盡法界之\n談。詎可分其處別。今從狹至寬略開十處。初\n此閻浮。二周百億。三盡十方。四遍塵道。五通\n異界。六該別塵。七歸華藏。八重攝剎。九猶帝\n網。十餘佛同。初此閻浮者。謂此閻浮菩提樹\n等七處八會。說此經法。二周百億者。謂盡此\n娑婆百億閻浮覺樹王等。同時俱說。三盡十\n方者。謂盡於十方虛空法界。所有一切須彌\n山界。無不同時皆說此法。如光明覺品說。四\n遍塵道者。謂於十方虛空界中。一一塵處皆\n有彼剎。悉於其中演說此經五通異界者。謂\n樹形等異類世界。有不可說佛剎微塵等。一\n一流類皆遍十方虛空法界。為與前須彌山\n\n界等。互不相礙。各於其中轉尊法輪。六該別\n塵者。謂＋（之）【乙】謂【大】，謂之【乙】謂謂之盡虛空界一一塵道。各亦同前攝自\n同類無量剎海。而於其中亦說此經。七歸華\n藏者。謂此等一切雜染世界各皆同盡。唯是\n蓮華藏莊嚴世界海數過剎塵。一一皆悉遍周＝周遍【乙】遍周【大】，周遍【乙】遍\n周周遍法界不相障礙。悉於其中演說斯法。八重\n攝剎者。於此華藏一一塵。皆攝無邊諸佛剎\n海。皆於其中說此經法。九猶帝網者。彼一一\n微塵。既各攝此無盡剎海。即此剎等復有微\n塵。彼諸塵內復有剎海。是即塵塵既其不盡。\n剎剎亦復不窮。如因陀羅網重重〔具十〕－【乙】具十【大】，〔－〕【乙】具十不可\n說其分量也。上來總是盧舍那佛說華嚴處。\n問若如上說。即七處八會皆悉＋（應）【乙】悉【大】，悉應【乙】悉悉應雜亂。如上忉\n利天處說十住時。既遍虛空周側毛道。未知\n夜摩等處亦說十住不。設爾何失。二俱有過。\n若彼不說即說處不遍。若彼亦說。何故經中＋（唯）【乙】中【大】，中唯【乙】中中唯\n云。忉利說十住法。夜摩等處說十行等。答此\n說十住忉利天處。既遍十方一切塵道。是故\n夜摩等處皆有忉利。即於如此遍夜摩等忉\n利天處說十住。是故忉利無不普遍。仍非\n夜摩。夜摩等處說十行等。皆亦遍於忉利等\n處。仍非忉利當知亦爾。若約十住與十行等\n全位相攝。即彼此互無各遍法界。若約諸\n位相資。即此彼互有同遍法界。餘＋（一一會）【乙】餘【大】，餘一一會【乙】餘餘一一會一一品一\n一文處。皆亦如是。准以思之。十餘佛同者。如\n此一佛說華嚴處如是不同。是即十方一切\n餘佛。各說華嚴處皆不同。准前知之。經云。\n三世諸佛已說今說當＝當說今【乙】今說當【大】，當說今【乙】今說當當說今說。又云。我不見有\n諸＋（佛）【乙】諸【大】，諸佛【乙】諸諸佛世界彼諸如來。不說此法。又如證法菩薩\n\n所說。當知餘佛無不同說。問餘佛說處與舍\n那說處。為相見不。設爾何失。二俱有過。謂若\n相見即乖相遍。若不相見不成主伴。答互為\n主伴通有四句。謂主主不相見。伴伴亦爾＝不相見【乙】爾【大】，不相見【乙】爾不相見。\n各遍法界彼此互無故無相見。主之與伴其\n必＝心【甲】必【大】，心【甲】必心相見。伴主亦爾共遍法界。此彼互有故。\n無不〔相〕－【乙】相【大】，〔－〕【乙】相見。如舍那為主證處為伴。無有主而\n不俱伴故。舍那與證處同遍法界。設於東方\n證法來處彼有。舍那還有東方而來作證。如\n是一一具具遠近。皆同遍周法界。一切塵道\n無障無礙。思之可見。 夫以。常恒之說＋（遍）【乙】說【大】，說遍【乙】說說遍。前後際而無涯。況念劫圓\n融豈可辨其時分。今略舉短脩分齊。析為十\n重。初唯一念。二盡七日。三遍三際。四攝同\n類。五收異劫。六念攝劫。七復重收。八異界\n時。九彼相入。十本收末。初唯一念者。謂於一\n剎那中。即遍如前無盡之處。頓說如此無邊\n法海。二盡七日者。謂佛初成道。於第二七日。\n普遍〔如〕－【乙】如【大】，〔－〕【乙】如前處說此經法。三遍三際者。謂盡前\n後際各無邊劫。常在彼界恒說此法。初無慚\n息。如不思議品說。四攝同類者。謂彼一切無\n邊劫中。一一劫內各攝無量同類劫海。常說\n此法＝經【乙】＊法【大】＊，經【乙】＊法經。五收異劫者。謂一一劫各攝無量異類\n劫海。如長劫攝短劫等。恒說此經。六念攝劫\n者。於一念中。即攝如上無量前後同異劫海。\n如是念念盡前後際。一一念中。皆各普攝一\n切諸劫。皆亦如是。如是"
    },
    "T10n0284": {
      "sutra_id": "T10n0284",
      "title": "大正新脩大藏經",
      "author": "東晉 祇多蜜譯",
      "volume": "10",
      "number": "284",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T10/T10n0284.xml",
      "total_chunks": 4,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, CBETA OCR Group, Punctuated text as provided by Mao Pei-Jun and Liao Yu-An and Liao Yu-Ci 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，CBETA 自行掃瞄辨識，毛佩君、廖予安、廖予慈大德提供新式標點 新式標點 佛說菩薩戒十二時竟。文殊師利白佛言：「菩\n薩用何功德得是十住？唯＝惟【三】【宮】唯【大】，惟【宋】【元】【明】【宮】唯惟願天中天分別\n說之。」 佛言：「善哉，善哉！文殊師利菩薩摩訶薩！\n多所憂念、多所安隱。吾當為汝＝若【聖】汝【大】，若【聖】汝若具說其要，\n諦聽諦受。」 文殊師利言：「受教。」 佛言：「有十住\n菩薩功德，各有高下，自有次第。」 文殊師利言：\n「何等為十？」 「一、住波藍質兜波菩薩法住。」 佛言＝主【宋】【元】【宮】【聖】言【大】，主【宋】【元】【宮】【聖】言主：「上頭見佛\n端正無比，視面色無有厭、無有逮者，尊貴無\n有能過者，所教授無有能踰者。見佛威神儀\n法如是，便稍稍入佛道中。轉開導之，皆隨其\n意教度脫之，見勤苦皆愍傷之。稍稍解曉佛\n語，信向之。新發起意學佛道，悉欲得了知佛\n智十難處，悉欲逮得之。 「何等為十難處？佛十\n種力是也。一者、當供養佛，二者、當隨其所樂\n當教語之，三者、所生處皆尊貴，四者、天上天\n下無有能及者，五者、佛智慧悉逮得，六者、世\n世所生處得見無央＝鞅【聖】＊央【大】＊，鞅【聖】＊央鞅數佛。七者、佛經悉逮\n\n得，八者、悉過度諸生死，九者、今脫去不久，十\n者、悉度脫十方人。 「二、住何等為阿闍浮菩薩法住？」 佛言：「有十意\n念十方人。何等為十意？一者、悉念世間善，二\n者、潔淨心，三者、皆安隱心，四者、柔軟心，五者、\n悉愛等，六者、心念但欲布施與人，七者、心悉\n常＝當【三】【宮】常【大】，當【宋】【元】【明】【宮】常當等護，八者、念人與我身無異，九者、心念十\n方人，視如視師，十者、心念十方人，視如視佛。 「阿闍浮菩薩法當多學經；多學經已，當獨處\n止；獨處止已＝以【聖】已【大】，以【聖】已以，常當與善師從事，當在善師\n邊易使。當隨時，隨時所作為勇；所作為既勇，\n當學人慧中以＝中慧已【三】【宮】慧中以【大】，中慧已【宋】【元】【明】【宮】慧。中以中慧已所受法當悉持，當＝常【聖】當【大】，常【聖】當常不忘也；\n既不忘者，當安隱處止。所以者何？益於十方\n人故。 「三、住何等為喻阿闍＋（浮）【三】【宮】＊闍【大】＊，闍浮【宋】【元】【明】【宮】＊闍闍浮菩薩法住者？」 佛言：「入於\n諸法中用十事。何等為十事？一者、謂所有皆\n無常，二者、謂所有皆勤苦，三者、謂所有皆虛\n空，四者、謂所有皆非我所，五者、謂所有皆無\n〔所住…所〕十字－【聖】（所住…所）十字【大】，〔－〕【聖】所住，六者、謂所有皆無〔所〕－【三】【宮】所【大】，〔－〕【宋】【元】【明】【宮】所利，七者、謂所有\n皆無所止＝心【三】【宮】止【大】，心【宋】【元】【明】【宮】止心，八者、謂所有皆無有＋（皆無有）【三】【宮】有【大】，有皆無有【宋】【元】【明】【宮】有有皆無有處，九者、謂\n所有皆無所著，十者、一切無所有。諸法悉入\n一法中、一法悉入諸法中，是為喻＝俞【聖】喻【大】，俞【聖】喻俞阿闍闍浮菩\n薩教法。 「四、住何等為闍＝閻【三】【宮】【聖】＊闍【大】＊，閻【宋】【元】【明】【宮】【聖】＊闍閻摩期菩薩法住者？」 佛言：「常願\n於佛處生。有十事。一者、不復還，二者、多深思\n於佛，三者、深思於法，四者、〔意〕－【三】【宮】【聖】意【大】，〔－〕【宋】【元】【明】【宮】【聖】意念比丘僧視\n十方人慈心，五者、思惟萬物皆無所有，六者、\n十方佛剎皆虛空，七者、宿命所作了無所有，\n八者、諸所有如幻皆虛空，九者、諸所勤苦無\n\n所有，十者、泥洹虛空亦無所有。用是故，生於\n佛法中，是為闍閻摩期菩薩教法。 「五、住何等為波俞三般菩薩法住者？」 佛言：「所\n作功德悉度十方人。有十事。一者、悉護十方\n人，二者、悉念十方人善，三者、悉念十方人\n令安隱，四者、悉愛十方人，五者、悉哀念十方\n人，六者、悉念十方人莫使作惡，七者、悉引十\n方人著菩薩道中，八者、悉清淨於十方人，九\n者、悉度脫十方人，十者、悉使十方人般泥洹。\n是為波俞三般菩薩法教＝教法【三】【宮】法教【大】，教法【宋】【元】【明】【宮】法教教法。 「六、住何等為阿耆三般菩薩法住者？」 "
    },
    "T48n2019B": {
      "sutra_id": "T48n2019B",
      "title": "大正新脩大藏經",
      "author": "高麗 知訥撰",
      "volume": "48",
      "number": "2019B",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T48/T48n2019B.xml",
      "total_chunks": 3,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Electronic Buddhadharma Society (EBS) 蕭鎮國大德提供，佛教電腦資訊庫功德會提供 原書標點 夫初心之人。須遠離惡友親近賢善。受五戒\n十戒等。善知持犯開遮。但依金口聖言。莫順\n庸流妄說。既已出家參陪清眾。常念柔和善\n順不得我慢貢高。大者為兄小者為弟。儻有\n諍者兩說和合。但以慈心相向。不得惡語傷\n人。若也欺凌同伴論說是非。如此出家全無\n利益。財色之禍甚於毒蛇省己知非常須遠\n離。無緣事則不得入他房院。當屏處不得強\n知他事。非六日不得洗浣內衣。臨盥漱不得\n高聲涕唾。行益次不得搪揬越序。經行次不\n得開襟掉臂。言談次不得高聲戲笑。非要事\n不得出於門外。有病人須慈心守護。見賓客\n須欣然迎接。逢尊長須肅恭迴避。辦道具須\n儉約知足。齋食時飲啜不得作聲執放。要須\n安詳不得舉顏顧視。不得欣厭精麁。須默無\n言說。須防護雜念。須知受食但療形枯為成\n道業。須念般若心經觀三輪清淨不違道用。\n赴焚修須早暮勤行自貴懈怠。知眾行次不\n得雜亂。讚唄呪願須誦文觀義。不得但隨音\n聲。不得韻曲不調。瞻敬尊顏不得攀緣異境。\n須知自身罪障猶如山海。須知理懺事懺可\n以消除。深觀能禮所禮皆從真性緣起。深信\n感應不虛影響相從。居眾寮須相讓不爭。須\n遞相扶護。慎詳論勝負。慎聚頭閑話。慎誤著\n\n他鞋。慎坐臥越次。對客言談不得揚於家醜。\n但讚院門佛事。不得詣庫房見聞雜事自生\n疑惑。非要事不得遊州獵縣。與俗交通令他\n憎嫉失自道情。儻有要事出行。告住持人及\n管眾者。令知去處。若入俗家切須堅持正念。\n慎勿見色聞聲流蕩邪心。又況披襟戲笑亂\n說雜事。非時酒食妄作無礙之行深乖佛戒。\n又處賢善人嫌疑之間。豈為有智慧人也。住\n社堂慎沙彌同行。慎人事往還。慎見他好惡。\n慎貪求文字。慎睡眠過度。慎散亂攀緣。若遇\n示師陞座說法。切不得於法作懸崖想生退\n屈心。或作串聞想生容易心。當須虛懷聞之。\n必有機發之時。不得隨學語者但取口辦。所\n謂蛇飲水成毒。牛飲水成乳。智學成菩提。愚\n學成生死是也。又不得於主法人生輕薄想。\n因之於道有障。不能進修切須慎之。論云。如\n人夜行罪人執炬當路。若以人惡故不受光\n明。墮坑落塹去矣。聞法之次如履薄氷。必須\n側耳目而聽玄音。肅情塵而賞幽致。下堂後\n默坐觀之。如有所疑博問先覺。夕惕朝詢不\n濫絲髮。如是乃可能生正信。以道為懷者歟。\n無始習熟愛欲恚癡纏綿意地。暫伏還起如\n隔日瘧。一切時中直須用加行方便智慧之\n力痛自遮護。豈可閑謾遊談無根虛喪天日。\n欲冀心宗而求出路哉。但堅志節責躬匪懈。\n知非遷善改悔調柔。勤修而觀力轉深。鍊磨\n而行門益淨。長起難遭之想道業恒新。常懷\n慶幸之心終不退轉。如是久久自然定慧圓\n明見自心性。用如幻悲智還度眾生。作人天\n\n大福田。切須勉之。泰和乙丑冬月。海東曹溪\n山老衲知訥誌。 師見蒙山來禮。先自問云。爾還信得及麼。山\n云。若信不及不到這裏。師云。十分信得更要\n持戒。持戒易得靈驗。若無戒行如空中架樓\n閣。還持戒麼山云。見持五戒。師云。此後只\n看箇無字。不要思量卜度。不得作有無解會。\n且莫看經教語錄之類。只單單提箇無字。於\n十二時中四威儀內。須要惺惺如猫捕鼠如\n鷄抱卵無令斷續。未得透徹時。當如老鼠咬\n棺材相似不可改移。時復鞭起疑云。一切含\n靈皆有佛性。趙州因甚道無意作麼生。既有\n疑時默默提箇無字迴光自看。只這箇無字\n要識得自己。要識得趙州。要捉敗佛祖得人\n憎處。但信我如此說話。驀直做將去。決定有\n發明時節。斷不誤爾。云云。 大凡行脚須以此道為懷。不可受現成供養\n了等閑過日。須是將生死二字釘在額上。十\n二時中裂轉面皮。討箇分曉始得。若秖隨群\n逐隊打空過時。他時閻羅老子打算飯錢。莫\n道我與爾不說。若做工夫須要日日打算時\n時點檢。自轉鼓起來至二更看。那裏是不得\n力處。那裏是打失處。那裏是不打失處。若如\n此做將去。定有到家時節。有一般辦道之人\n經不看佛不禮。纔上薄團便打瞌睡。及至醒\n來又且胡思亂想。纔下禪床便與人打雜交。\n若如此辦道至彌勒下生。也未有入手底時\n\n節。須是猛著精彩提起一箇無字。晝三夜三\n與他廝睚。不可坐在無事甲裏。又不可執在\n蒲團上死坐。須要活弄。恐雜念紛飛起時千\n萬。不可與他廝鬪轉鬪轉急。多有人在這裏\n不識進退解免不下。成風成顛壞了一生。須\n向紛飛起處輕輕放下打一箇。轉身下地行\n一遭。又上床開兩眼揑雙拳。竪起脊梁依前\n提起。便覺清涼。如一鍋湯攙下一杓冷水相\n似。但如此做工夫。日久月深自有到家時節。\n工夫未得入手。莫生煩惱。恐煩惱魔入心。若\n覺省力不可生歡喜。恐歡"
    },
    "T28n1553": {
      "sutra_id": "T28n1553",
      "title": "大正新脩大藏經",
      "author": "尊者瞿沙造  失譯",
      "volume": "28",
      "number": "1553",
      "juan": "2卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T28/T28n1553.xml",
      "total_chunks": 32,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，李明芳大德提供新式標點 新式標點 云何布施？自持財物施與。為三種故：自為身\n故、為他人故、為彼我故。供養塔寺、佛、辟支佛、\n阿羅漢，自為身故；施與眾生，為他人故；布施\n與人，為彼我故。思、田、物好，得好報。云何思好？\n信淨與供養。云何田好？有三種田：有大德、有\n貧苦、有大德貧苦。云何大德？佛、菩薩、辟支佛、\n阿羅漢、阿那含、斯陀含、須陀洹。云何貧苦？畜\n生、老病聾盲瘖瘂，如是種種貧苦。云何大德\n貧苦？有佛、菩薩、辟支佛、阿羅漢、阿那含、斯陀\n含、須陀洹，老病聾盲瘖瘂貧苦。大德田者，恭\n敬心得大報。貧苦田者，憐愍心得大報。大德\n貧苦田者，恭敬憐愍心得大報。是為福田好。\n云何物好？不殺他、不偷不奪、不繫不鞭、不欺\n不誑，淨物隨多少隨時布施，是為物好。信云\n何？知後世果，若涅槃一心不動，是謂信。淨云\n何？自除慳貪、恭敬於人，是謂淨。供養云何？奉\n迎禮拜、自手施與等，是謂供養。云何田異？行\n善、持戒、禪定、智慧、解脫、得果等功德，若有是，\n是謂田異。救濟危厄異、因緣得異，苦有無苦，\n發心供給得妙果報。布施佛，即時一切得福。\n布施眾僧，若受用得一切福；未受用不得一\n切福。供養法故得大報。若學人聰明大智慧，\n\n以法故供養，是謂供養法。布施得富，受施竟\n得樂力壽等功德，除結勝，得大果報。若施畜\n生受百世報，若施不善人受千世報，若施善\n人受千萬世報，若施離欲凡夫受千萬億世\n報，若施得道人得無數世報，若施佛至涅槃\n受報。布施有六難：一者憍慢施；二者求名施；\n三者為力施；四者強與施；五者因緣施；六者\n求報施，眾僧中分別施，是謂布施六難。 云何\n持戒？有二種律儀：不善、善律儀。云何不善？殺\n生、偷盜、婬妷，是謂身三惡律儀。兩舌、惡口、妄\n言、綺語，是謂口四惡律儀。貪、恚、惡邪，是謂意\n三惡律儀。云何殺生？有他生，知是生，故奪命，\n如是殺生。有他受物，知是他受物，故盜心偷\n奪，如是盜。有婦女，他所有，知他婦女，故欲共\n婬，若道非道中；自有婦犯非道，如是婬妷。若\n知言不知、不知言知，若疑言不疑、不疑言疑，\n如是妄語。若有實，欲別離故異說，是謂兩舌。\n染污心，他人不愛＝受【三】【宮】愛【大】，受【宋】【元】【明】【宮】愛受言，如是惡口。不知時、無義\n言，如是綺語。財物他有，貪愛應我有，如是貪。\n見彼不喜、欲令苦痛，如是恚。惡邪有二種：\n實有物而言無、顛倒見聞。云何實有物而言\n無？無罪無福報、無今世後世、無父母、無佛辟\n支佛阿羅漢餘得道等，如是實有而言無。云\n何顛倒見聞？善惡天作非行報果，如是惡邪。\n是謂三種不善業。悔是三事，除却不作，是謂\n三種善業。常遠三種惡、行三種善，是謂持戒\n堅固。布施、持戒、禪定思惟，必得三果：得財富、\n得生天、得解脫。世〔三十〕－【三】【宮】三十【大】，〔－〕【宋】【元】【明】【宮】三十種福田。父母、老病、善\n人、離欲凡夫、有漏七人、四道向、四道果、從滅\n\n禪入起、辟支佛、菩薩、佛、比丘僧、有去來人飢\n渴。 三界：欲界、色界、無色界。是三界中有五種道：\n地獄、畜生、鬼神、人天及中陰道。云何地獄＋（道）【三】【宮】地獄【大】，地獄道【宋】【元】【明】【宮】地獄地獄道？大\n地獄八種：第一僧時披；第二黑繩；第三合會；\n第四魯臘；第五摩呵魯臘；第六般那；第七波\n多般；第八阿鼻，一一大地獄各有十六地獄\n眷屬。云何畜生＋（道）【三】【宮】畜生【大】，畜生道【宋】【元】【明】【宮】畜生畜生道？無脚、兩脚、四脚、多脚，水行、陸\n行、空行。云何鬼神道？種種身，欲界不善行三\n種：上、中、下，上報地獄、中報畜生、下報餓鬼。云\n何人道？四種人：東弗于逮人、西瞿耶尼人、南\n閻浮提人、北欝單曰人，欲界四種善行報生。\n云何天道？欲界有六天：第一四天王天；第二\n忉利天；第三鹽天；第四兜術天；第五尼摩羅\n天；第六他化自在天，欲界中六種善報生。色\n界十七處：梵富樓、梵迦夷、摩呵梵、少光、無量\n光、光曜、少淨、無量淨、遍淨、果實、得德、大果、不\n煩、不惱、善觀、快見、阿迦尼吒。四禪三種：上、\n中、下，報十二處生四禪有漏無漏雜報。五淨\n居聖人生三處，聖人凡夫共生大果處。凡夫\n得無想定生無想天。"
    },
    "T14n0443": {
      "sutra_id": "T14n0443",
      "title": "大正新脩大藏經",
      "author": "隋 闍那崛多譯",
      "volume": "14",
      "number": "443",
      "juan": "8卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T14/T14n0443.xml",
      "total_chunks": 43,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Xian 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，Xian 大德提供新式標點 新式標點 如是我聞： 一時，婆伽婆住王舍大城耆闍崛\n山中，與大比丘眾千二百五十人俱；復有菩\n薩摩訶薩眾一萬二千人俱，時，阿逸多菩薩\n為首。 爾時，世尊告彌勒菩薩言：「彌勒！東方去此佛\n剎，有十不可說諸佛剎土，億百千微塵數等。\n過是諸佛剎，有一佛土，名曰解脫主世界，彼\n世界內有一佛，名曰虛空功德清淨微塵等\n目端正功德相光明華波頭摩琉璃光寶體\n香最上香供養訖種種莊嚴頂髻無量無邊日\n月光明願力莊嚴變化莊嚴法界出生無障礙\n王如來、阿羅訶、三藐三佛陀，現＝見【三】【宮】現【大】，見【宋】【元】【明】【宮】現見在隨心欲行\n〔道〕－【三】【宮】道【大】，〔－〕【宋】【元】【明】【宮】道逍遙在處說法。若善男子、善女人，犯四波\n羅夷，是人罪重，假使如閻浮利地變為微\n\n塵，一一微塵成於一劫，是人有若干劫罪，稱\n是一佛名號、禮一拜者，悉得滅除；況復晝夜\n受持、讀誦、憶念不忘者，是人功德，不可思議。\n彼世界中有一菩薩，名曰難匹無障礙王，〔而〕－【元】【明】【宮】而【大】，〔－〕【元】【明】【宮】而\n如來授彼菩薩記，當得成佛，號曰毫相日月\n光明焰寶蓮華固＝堅【三】【宮】固【大】，堅【宋】【元】【明】【宮】固堅如金剛身毘盧遮那無障\n礙眼圓滿十方放光普照一切佛剎相王如來、\n阿羅訶、三藐三佛陀、善逝、世間解、無上士、調御\n丈夫、天人師、佛、世尊。 「然彼東方，復更有佛，名\n一切莊嚴無垢光如來、阿羅訶、三藐三佛陀。\n〔亦〕－【三】【宮】亦【大】，〔－〕【宋】【元】【明】【宮】亦應當稱彼佛＝如來【三】【宮】佛【大】，如來【宋】【元】【明】【宮】佛如來名號，恭敬尊重。 「南方有佛，名曰辯才瓔珞思念如來、阿羅訶、\n三藐三佛陀。亦應當稱彼佛名＝如來號【三】【宮】佛名【大】，如來號【宋】【元】【明】【宮】佛名如來號，（亦修…名號）十八字＝常念恭敬【三】【宮】＊（亦修…名號）十八字【大】＊，常念恭敬【宋】【元】【明】【宮】＊亦修恭\n敬，亦須稱其名號，亦須心念彼佛名號常念恭敬。 「西方有佛，名曰無垢月相王名稱如來、阿羅\n訶、三藐三佛陀。亦應當稱彼佛名，亦修恭\n敬，亦須稱其名號，亦須心念彼佛名號常念恭敬。 「北方有佛，名曰華莊嚴作光明如來、阿羅訶、\n三藐三佛陀。亦應當稱彼佛名，亦修恭敬，亦\n須稱其名號，亦須心念彼佛名號。 「東南方有佛，名曰作燈明如來、阿羅訶、三藐\n三佛陀。亦應當稱彼佛名，亦修恭敬，亦須\n稱其名號，亦須心念彼佛名號常念恭敬。 「西南方有佛，名曰寶上相名稱如來、阿羅訶、\n三藐三佛陀。亦應當稱彼佛名，亦修恭敬，亦\n須稱其名號，亦須心念彼佛名號。 「西北方有佛，名曰無畏觀如來、阿羅訶、三藐\n三佛陀。亦應當稱彼佛名，亦修恭敬，亦須\n稱其名號，亦須心念彼佛名號常念恭敬。 「東北方有佛，名曰無畏無怯毛孔不竪名稱\n如來、阿羅訶、三藐三佛陀。亦應當稱彼佛\n名，亦修恭敬，亦須稱其名號，亦須心念彼佛\n名號常念恭敬。 「下方有佛，名曰師子奮迅根如來、阿羅訶、三\n藐三佛陀。亦應當稱彼佛名，亦修恭敬，亦\n須稱其名號，亦須心念彼佛名號常念恭敬。 「上方有佛，名曰金光威王相似如來、阿羅訶、\n三藐三佛陀。亦應當稱彼佛名，亦修恭敬，\n亦須稱其名號，亦須心念彼佛名號常念恭敬。」 爾時，佛告彌勒＋（菩薩）【三】【宮】彌勒【大】，彌勒菩薩【宋】【元】【明】【宮】彌勒彌勒菩薩：「若有正信善男子、正信善女\n人，至心稱此十二諸佛名號之時，經於十日，\n當修懺悔一切諸罪，一切眾生所有功德皆\n當隨喜，勸請一切諸佛久住於世，以諸善根\n迴向法界，是時即得滅一切諸罪，得（淨…即得）七字＝清淨業【三】【宮】（淨…即得）七字【大】，清淨業【宋】【元】【明】【宮】淨一\n切業障，即得清淨業具足成就莊嚴一切佛土，成就\n具足無畏，復得具足莊嚴身相，復得具足菩\n薩眷屬圍遶，復得具足無量陀羅尼，復得具\n足無量三昧，復得具足如意佛剎莊嚴，亦得\n具足無量善知識，速得成就如上所說不增\n不減，在於煩惱中行阿耨多羅三藐三菩提，\n而得端正可喜＝愛【三】【宮】喜【大】，愛【宋】【元】【明】【宮】喜愛果報，亦得財寶充足，常生大\n姓豪族〔種姓〕－【三】【宮】種姓【大】，〔"
    },
    "T17n0764": {
      "sutra_id": "T17n0764",
      "title": "大正新脩大藏經",
      "author": "宋 施護譯",
      "volume": "17",
      "number": "764",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T17/T17n0764.xml",
      "total_chunks": 5,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，李明芳大德提供新式標點 新式標點 歸命頂禮一切佛、一切智智、天人師。無邊無\n數佛說法，略集所說正法名。先歸命三寶，所\n謂佛、法、僧。 云何三乘？所謂大乘、緣覺、聲聞。 云何七種最上＝最大【三】最上【大】，最大【宋】【元】【明】最上最大供養？所謂禮拜、供養、懺悔、隨\n喜、勸請、發願、迴向。 云何三根本？所謂發菩提心、清淨心、自性空\n斷我見。 云何十波羅蜜？所謂布施、持戒、忍辱、精進、禪\n定、智慧、方便、願、力、智。 云何十八空？所謂內空、外空、內外空、空空、大\n空、勝義空、有為空、無為空、畢竟空、無際空、散空、\n一切法空、本性空、自相空、無相空、無性空、自性\n空、無性自性空。 云何四無量？所謂慈無量、悲無量、喜無量、捨\n無量。 云何四攝法？所謂布施、愛語、利行、同事。 云何五通？所謂天眼、天耳、他心、宿命、神境。 云何四聖諦？所謂苦諦、集諦、滅諦、道諦。 云何五蘊？所謂色蘊、受蘊、想蘊、行蘊、識蘊。 云何出世五蘊？所謂戒蘊、定蘊、慧蘊、解脫蘊、\n解脫知見蘊。 云何十二緣生？所謂無明、行、識、名色、六入、觸、\n\n受、愛、取、有、生、老死。 云何三十七菩提分法？所謂四念處、四正斷、\n四神足、五根、五力、七菩提分、八聖道。 云何四\n念處？所謂觀身身念處、觀受受念處、觀心心\n念處、觀法法念處。 云何四正斷？所謂未生不\n善法不令生、已生不善法令正斷、未生善法\n令發生、已生善法令增長。真實不妄，發精進\n心，令得圓滿。 云何四神足？所謂集定斷行具神足、心定斷\n行具神足、精進定斷行具神足、我定斷行具\n神足。 云何五根？所謂信根、進根、念根、定根、慧根。 云何五力？所謂信力、進力、念力、定力、慧力。 云何七菩提分？所謂念菩提分、擇法菩提分、\n精進菩提分、喜菩提分、輕安菩提分、定菩提分、\n捨菩提分。 云何八聖道？所謂正見、正思惟、正語、正業、正\n命、正精進、正念、正定。如是三十七菩提分法。 云何四法種？所謂正利、正文、正智、正識。 云何六念？所謂念佛、念法、念僧、念戒、念施、念\n天。 云何四法印？所謂一切行無常、一切行苦、一\n切法無我、涅槃寂靜。 云何十善？所謂不殺生、不偷盜、不婬欲、不妄\n語、不兩舌、不惡口、不綺語、不貪、不瞋、不癡。 云何四根本煩惱？所謂貪、瞋、癡、我慢。 云何五見？所謂身見、邊見、邪見、見取、戒禁取。 云何四漏？所謂欲漏、有漏、無明漏、見漏。 云何三解脫？所謂空解脫、無相解脫、無願解\n\n脫。 云何八有色？所謂地、水、火、風、香、味、觸、法。 云何二無色？所謂虛空、識性。 云何八定解脫？所謂內有色觀外色解脫、內\n無色觀外色解脫、觀淨解脫具足住、觀空無\n邊處解脫、觀識無邊處解脫、觀無所有處解\n脫、觀非想非非想處解脫、觀想受滅解脫。 云何九部法？所謂契經、祇夜、受記、伽他、諷誦、\n因緣、本事、本生、方廣。 云何十二頭陀行？所謂常乞食、次第乞食、一\n座食、先止後食、持三衣、毳衣、糞掃衣、於其草上\n長坐不臥、顯路處居住、樹下住、塚間住、空寂處\n住。 云何十地？所謂歡喜地、離垢地、發光地、焰慧\n地、難勝地、現前地、遠行地、不動地、善慧地、法雲\n地。 云何菩薩十降伏？所謂命降伏、心降伏、受用\n降伏、法降伏、生降伏、神通降伏、解脫降伏、願降\n伏、業降伏、智降伏。 云何菩薩十力？所謂解脫力、拔苦力、觀力、忍\n力、智力、斷力、聞力、願力、圓滿力、愛力。 云何如來十力？所謂處非處智力、自業智力、\n知眾生性智力、根勝劣智力、種種界智力、種\n種勝解智力、遍趣行智力、淨慮解脫等持等\n至智力、宿住隨念智力、漏盡智力。 云何四知？所謂知一切法種、知一切說法、知\n涅槃正道、知漏盡智斷。 云何五貪妬？所謂法貪妬、利養貪妬、住貪\n妬、為善貪妬、名聞貪妬。 云何十八不共法？所謂身無失、口無失、意無\n失、無不定心、無異想心、無不知捨心、欲無減、\n念無減、精進無減、智慧無減、解脫無減、解脫\n知見無減、身業隨智慧行、口業隨智慧行、\n意業隨智慧行、知過去無礙、知未來無礙、知\n現在無礙。 云何三十二相？所謂足下平滿相、足下千輻\n輪文相、手足柔軟相、手足指間有金色網＝綱【宋】【宮】網【大】，綱【宋】【宮"
    },
    "T26n1542": {
      "sutra_id": "T26n1542",
      "title": "大正新脩大藏經",
      "author": "尊者世友造  唐 玄奘譯",
      "volume": "26",
      "number": "1542",
      "juan": "18卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T26/T26n1542.xml",
      "total_chunks": 141,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，李明芳大德提供新式標點 新式標點 有五法：一、色；二、心；三、心所法；四、心不相應\n行；五、無為。色云何？謂諸所有色，一切四大\n種及四大種所造色。四大種者，謂地界、水界、\n火界、風界。所造色者，謂眼根、耳根、鼻根、舌根、\n身根、色、聲、香、味、所觸一分及無表色。心云何？\n謂心意識。此復云何？謂六識身，即眼識、耳識、\n鼻識、舌識、身識、意識。心所法云何？謂若法心\n\n相應。此復云何？謂＝識【三】【宮】＊謂【大】＊，識【宋】【元】【明】【宮】＊謂識受、想、思、觸、作意、欲、勝解、念、\n定、慧、信、勤、尋、伺、放逸、不放逸、善根、不善根、無記\n根，一切結、縛、隨眠、隨煩惱、纏，諸所有智，諸所\n有見，諸所有現觀。復有所餘如是類法與心\n相應，總名心所法。心不相應行云何？謂若法\n心不相應。此復云何？謂得、無想定、滅定、無想\n事、命根、眾同分、依得、事得、處得、生、老、住、無常\n性、名身、句身、文身，復有所餘如是類法與心\n不相應，總名心不相應行。無為云何？謂三無\n為：一、虛空；二、非擇滅；三、擇滅。 地界云何？謂堅性。水界云何？謂濕性。火界云\n何？謂煖性。風界云何？謂輕等動性。眼根云\n何？謂眼識所依淨色。耳根云何？謂耳識所依\n淨色。鼻根云何？謂鼻識所依淨色。舌根云\n何？謂舌識所依淨色。身根云何？謂身識所依\n淨色。色云何？謂諸所有色，若好顯色、若惡顯\n色、若二中間，似顯處色。如是諸色二識所識，\n謂眼識及意識。此中一類眼識先識，眼識受\n已意識隨識。聲云何？此有二，謂有執受大種\n為因聲，及無執受大種為因聲。如是諸聲二\n識所識，謂耳識及意識。此中一類耳識先識，\n耳識受已意識隨識。香云何？謂諸所有香，若\n好香、若惡香、若平等香，鼻所嗅。如是諸香二\n識所識，謂鼻識及意識。此中一類鼻識先識，\n鼻識受已意識隨識。味云何？謂諸所有味，若\n可意、若不可意、若順捨處，舌所嘗。如是諸味\n二識所識，謂舌識及意識。此中一類舌識先\n識，舌識受已意識隨識。所觸一分云何？謂滑\n性、澁性、輕性、重性、冷飢渴性，身所觸。如是諸\n\n觸及四大種，二識所識，謂身識及意識。此中\n一類身識先識，身識受已意識隨識。無表色\n云何？謂法處所攝色。此及五色根，於一切時\n一識所識，謂意識。 眼識云何？謂依眼根各了別色。耳識云何？謂\n依耳根各了別聲。鼻識云何？謂依鼻根各了\n別香。舌識云何？謂依舌根各了別味。身識云\n何？謂依身根各了別所觸。意識云何？謂依意\n根了別諸法。 受云何？謂領納性。此有三種，謂樂受、苦受、不\n苦不樂受。想云何？謂識取像性。此有三種，謂\n小想、大想、無量想。思云何？謂心造作性，即是\n意業。此有三種，謂善思、不善思、無記思。觸云\n何？謂三和合性。此有三種，謂順樂受觸、順苦\n受觸、順不苦不樂受觸。作意云何？謂心警覺\n性。此有三種，謂學作意、無學作意、非學非無\n學作意。欲云何？謂樂作性。勝解云何？謂心正\n勝解、已勝解、當勝解性。念云何？謂心明記性。\n定云何？謂心一境性。慧云何？謂心擇＝澤【宮】擇【大】，澤【宮】擇澤法性。信\n云何？謂心澄淨性。勤云何？謂心勇悍性。尋云\n何？謂心麁動性。伺云何？謂心細動性。放逸云\n何？謂不修善法性。不放逸云何？謂修善法性。\n善根云何？謂三善根，即無貪善根、無瞋善根、\n無癡善根。不善根云何？謂三不善根，即貪不\n善根、瞋不善根、癡不善根。無記根云何？謂四\n無記根，即無記愛、無記見、無記慢、無記無明。 結有九種，謂愛結、恚結、慢結、無明結、見結、取\n結、疑結、嫉結、慳結。愛結云何？謂三界貪。恚結\n云何？謂於有情能為損害。慢結云何？謂七慢\n\n類，即慢、過慢、慢過慢、我慢、增上慢、卑慢、邪慢。\n慢者，於劣謂己勝、或於等謂己等，由此正慢\n已慢當慢，心高舉、心恃篾＝蔑【三】【宮】＊篾【大】＊，蔑【宋】【元】【明】【宮】＊篾蔑。過慢者，於等謂\n己勝、或於勝謂己等，由此正慢已慢當慢，心\n高舉、心恃篾蔑。慢過慢者，於勝謂己勝，由此\n正慢已慢當慢，心高舉、心恃篾蔑。我慢者，於\n五取蘊等隨觀執我或我所，由此正慢已\n慢當慢，心高舉、心恃篾蔑。增上慢者，於所未\n得上勝證法謂我已得、於所未至上勝證\n法謂我已至、於"
    },
    "T19n0978": {
      "sutra_id": "T19n0978",
      "title": "大正新脩大藏經",
      "author": "宋 法天譯",
      "volume": "19",
      "number": "978",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T19/T19n0978.xml",
      "total_chunks": 6,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，北美某大德提供，李明芳大德提供新式標點 新式標點 如是我聞： 一時佛在極樂佛剎大善法堂中\n安庠而坐。爾時無量壽如來應正等覺告聖\n觀自在菩薩摩訶薩言：「善男子！所有一切眾\n生疾病苦惱及短壽者，為利益彼故，所有一\n切如來烏瑟膩沙最勝總持法門若人受持\n讀誦，速得無病長壽安樂。」 即時觀自在菩薩摩訶薩從座而起，合掌恭\n敬白佛言：「世尊！我今樂聞此一切如來烏瑟\n膩沙最勝總持法門，善誓善說。」 爾時世尊觀察大會人天眾已，入普照吉祥\n三摩地。從定出已，說此一切如來烏瑟膩沙\n\n最勝總持法門曰： 「唵引曩謨婆誐嚩帝薩哩嚩二合怛二合路枳\n也二合鉢囉二合底尾始瑟吒二合引野沒馱引野\n帝曩莫入怛儞也二合他引唵引部隴二合部隴二\n合部隴二合輸達野輸達野尾輸達野尾輸達\n野阿三摩三滿多引嚩婆引娑薩頗二合囉拏誐\n底誐誐曩莎婆嚩尾戍提阿毘詵左覩𤚥引薩\n哩嚩二合怛他引誐多引酥誐多嚩囉嚩左曩引\n沒哩二合多毘試罽摩賀引母捺囉二合滿怛囉\n二合波奈阿引賀囉阿引賀囉阿引欲散馱引囉\n尼輸達野輸達野誐誐曩莎婆引嚩尾戍提引\n烏瑟膩二合沙尾惹仁左反＝切【明】反【大】，切【明】反切野波哩戍提引娑賀\n薩囉二合囉濕彌二合散祖禰帝引薩哩嚩二合\n怛他引誐多引嚩路吉儞沙吒波引囉彌多引波\n哩布囉尼薩哩嚩二合怛他引誐多摩引帝捺舍\n部彌鉢囉二合底瑟致二合帝引薩哩嚩二合怛\n他引誐多紇哩二合那野引地瑟吒二合引曩引地\n瑟致二合帝引母捺哩二合母捺哩二合摩賀引母\n捺哩二合嚩日囉二合迦引野僧賀引多曩波哩\n戍提引薩哩嚩二合迦哩摩二合嚩囉拏尾戍提\n引鉢囉二合底儞嚩哩多二合野引欲尾戍提引\n薩哩嚩二合怛他引誐多三摩野引地瑟吒二合\n曩地瑟致二合帝引唵引牟儞牟儞摩賀引牟儞\n尾牟儞尾牟儞摩賀引尾牟儞摩底摩底摩賀\n引摩底摩摩多引蘇摩底怛他引多引部多俱致\n波哩戍提引尾娑普二合吒沒提戍提引呬呬\n惹野惹野尾惹野尾惹野娑摩引囉娑摩二合\n囉娑頗二合囉娑頗二合囉薩哩嚩二合沒馱引\n地瑟吒二合引曩引地瑟致二合帝引戍提戍提引\n\n沒提引嚩日哩二合嚩日哩二合摩賀引嚩日哩\n二合蘇嚩日哩二合嚩日囉二合誐哩毘二合惹\n野誐哩毘二合尾惹野誐哩毘二合嚩日囉二合\n入嚩二合引攞引誐哩毘二合嚩日嚕二合捺婆二合\n吠引嚩日囉二合三婆吠引嚩日哩二合嚩𡁠尼\n嚩日覽二合婆嚩覩摩摩此處稱名舍哩覽薩哩嚩二\n合薩埵難引左迦引野波哩戍提哩婆二合嚩覩\n彌薩那引薩哩嚩二合誐底波哩戍提室左二合\n薩哩嚩二合怛他誐多引室左二合𤚥三摩引濕\n嚩二合〔引〕－【明】引【大】，〔－〕【明】引娑演覩沒＝𠆙切身【宋】【明】＊【大】＊，𠆙切身【宋】【明】＊𠆙切身沒𠆙切身悉＝𠆙【宋】【明】【大】，𠆙【宋】【明】𠆙達野達\n野尾達野尾達野謨左野謨左野尾謨左\n野尾謨左野輸達野輸達野尾輸達野尾輸達\n野三滿多引哩謨二合左野三滿多囉濕彌二合\n波哩戍提引薩哩嚩二合怛他引誐多紇哩二合\n那野引地瑟吒二合曩引地瑟致二合帝引母捺\n哩二合母捺哩二合摩賀引母捺哩二合滿怛囉二\n合波禰去娑嚩二合賀」 「善男子！此一切如來烏瑟膩沙最勝總持法\n門，能延【CB】【麗-CB】，廷【大】延K34n1204_p0287b03廷壽命、消除罪業速得清淨。若以素帛\n或樺皮上書寫此總持法門，安置塔中作廣\n大供養。作供養已，右繞千匝恭敬禮拜、隨力\n供養，獲增智慧。若七日壽命延至七年，若七\n年壽命延（至）＋七【明】七【大】，至七【明】七至七十歲，獲得如是長壽安樂，無諸\n疾病，得宿命通明記不忘。若戴頂上，如前所\n獲消除罪障。 「復次若以淨帛及樺皮上，用牛黃書此總持\n及自名姓，用栴檀作塔，盛此總持安置房內，\n獻廣大供養旋繞千匝，誦此總持八百遍，消\n除眾病，延壽百歲。 「復次如無栴檀，當用淨泥為塔，內畫羯磨杵，\n外畫金剛界四門守護，中書自己名及安置\n總持，所獲功德如前無異。或用牛黃書此總\n持，安淨器內，復以淨器蓋之，安置房中作廣\n大供養，長得衛護無諸災難。 「復次當用不著地瞿摩夷作四方曼拏羅，以\n白花散上，燃酥燈四盞安壇四隅，焚沈香乳\n香，滿鉢盛閼伽水，復用白花作鬘，以此總持\n或安塔中或功德像中安於壇上。持誦之人\n以左手按壇、右手持數珠，一日三時誦此總\n持二十一遍加持水三合，以自飲之，能消諸\n病延壽百年，解諸冤結，得妙音聲獲無礙辯，\n生生常得宿命神通。若將前加持淨水灑於\n王宮及自舍宅，乃至牛馬等所住之處，速得\n去除羅剎龍蛇之難，常得衛護，離諸怖畏。若\n有病苦"
    },
    "T24n1456": {
      "sutra_id": "T24n1456",
      "title": "大正新脩大藏經",
      "author": "唐 義淨譯",
      "volume": "24",
      "number": "1456",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T24/T24n1456.xml",
      "total_chunks": 1,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Gaya Foundation, Text as provided by Anonymous from USA, Punctuated text as provided by Ven. Shi Ben-Chan 蕭鎮國大德提供，伽耶山基金會提供，北美某大德提供，釋本禪法師提供新式標點 新式標點 尼陀〔那〕－【三】【宮】那【大】，〔－〕【宋】【元】【明】【宮】那五十二頌。 〔目得迦…頌〕七字－【明】（目得迦…頌）七字【大】，〔－〕【明】目得迦四十八頌。 （尼陀那…頌）十四字∞（大門…曰）六字【宮】【聖】大門總攝頌曰【大】∞尼陀那五十二頌目得迦四十八頌【宮】【聖】大門總攝頌曰尼陀那五十二頌目得迦四十八頌： 別門初總攝頌曰此有十事，盡不截皮： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： 第七子攝頌曰： 第八子攝頌曰： 第九子攝頌曰： 第十子攝頌曰： 別門第二總攝頌曰： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： 第七子攝頌曰： 第八子攝頌曰： 第九子攝頌曰： 第十子攝頌曰： 別門第三總攝頌曰： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： 第七子攝頌曰： 第八子攝頌曰： 第九子攝頌曰： 第十子攝頌曰： 別門第四總攝頌曰： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： 第七子攝頌曰： 第八子攝頌曰： 第九子攝頌曰： 第十子攝頌曰： 別門第五總攝頌曰： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： （大門…曰）六字∞（目得…頌）七字【明】大門總攝頌曰【大】∞目得迦四十八頌【明】大門總攝頌曰目得迦四十八頌（大門…曰）六字∞（目得…頌）七字【明】，〔目得迦四十八頌〕－【宋】【元】【宮】【聖】〔－〕【宋】【元】【宮】【聖】，目得迦四十八頌【大】∞大門總攝頌曰【明】目得迦四十八頌大門總攝頌曰： 別門〔第一〕－【宮】【聖】第一【大】，〔－〕【宮】【聖】第一總攝頌曰： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： 第七子攝頌曰： 第八子攝頌曰： 第九子攝頌曰： 第十子攝頌曰： （目得迦）＋別【宋】【元】【聖】別【大】，目得迦別【宋】【元】【聖】別目得迦別門第二總攝頌曰： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： 第七子攝頌曰： 第八子攝頌曰： 第九子攝頌曰： 第十子攝頌曰： （目得迦）＋第【宋】【元】【宮】【聖】第【大】，目得迦第【宋】【元】【宮】【聖】第目得迦第三別門總攝頌曰： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： 第七子攝頌曰： 第八子攝頌曰： 第九子攝頌曰： 第十子攝頌曰： 別門第四總攝頌曰： 第一子攝頌曰： 第二子攝頌曰： 第三子攝頌曰： 第四子攝頌曰： 第五子攝頌曰： 第六子攝頌曰： 第七子攝頌曰： 第八子攝頌曰： 第九子攝頌曰： 第十子攝頌曰： 此翻場列位依宋元二本載大唐景龍四年歲次庚戌四月壬午朔十五\n日景申三藏法師大德沙門義淨宣釋梵本\n并綴文正字 翻經沙門吐火羅大德達摩秫＝𥞊【聖】秫【大】，𥞊【聖】秫𥞊唐證梵義 翻經沙門中天竺國大德校＝拔【聖】校【大】，拔【聖】校拔努證梵義 翻經沙門罽賓國大德達摩難陀證梵文＝義【聖】文【大】，義【聖】文義 翻經沙門淄州大雲寺大德慧沼證義 翻經沙門洛州崇光＝先【聖】光【大】，先【聖】光先寺大德律師道琳證\n義 翻經沙門福壽寺寺主大德利明證義 翻經沙門洛州太平寺大德律師道恪證義 翻經沙門大薦福寺大德勝莊證義 翻經沙門相州禪河寺大德玄傘證義筆受 翻經沙門大薦福寺大德律師智積證義正\n字 翻經沙門德州大雲寺寺主慧傘證義 翻經沙門西涼州白＝伯【聖】白【大】，伯【聖】白伯塔寺大德慧積讀梵\n本 翻經婆羅門右驍衛翊府中郎員外置宿衛\n臣李釋迦＝加【聖】迦【大】，加【聖】迦加讀梵本 翻經婆羅門東天竺國左屯＋（衛）【聖】屯【大】，屯衛【聖】屯屯衛翊府中郎將\n員外置同正員臣瞿金剛證譯 翻經婆羅門東天竺國大首領臣伊舍羅證\n梵本 翻經婆羅門東天竺國左執戟直中書省臣\n度頗具讀梵本 翻經婆羅門龍播國大達官准三＝五【聖】三【大】，五【聖】三五品臣李\n輸羅證譯 金紫光"
    },
    "T01n0091": {
      "sutra_id": "T01n0091",
      "title": "大正新脩大藏經",
      "author": "後漢 安世高譯",
      "volume": "1",
      "number": "91",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T01/T01n0091.xml",
      "total_chunks": 3,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Mr. Chang Wen-Ming, Text as provided by Anonymous from USA, Punctuated text as provided by Dhammavassarama 蕭鎮國大德提供，張文明大德提供，北美某大德提供，法雨道場提供新式標點 新式標點 聞如是： 一時，婆伽婆在舍衛城祇樹給孤獨\n園。彼時有異婆羅門，有一子命終愛念不離。\n彼命終亦不能食，亦不能飲，亦不著衣亦不\n塗香，但至塚間而啼泣，彼啼泣憶念在抱上。\n於是彼婆羅門彷徉而行至世尊所，到已共\n世尊面相慰勞。面相慰勞已，彼婆羅門却坐\n一面已。世尊告曰：「何以故？汝婆羅門諸根不\n常定？」 「此瞿曇！我意根云何意根當定？我有一\n子而命終，愛念不＝人【宋】【元】不【大】，人【宋】【元】不人離。彼命終，我不能食、不能\n飲、不著衣、不塗香，我但在家啼泣，啼泣時憶\n念在抱上。」 「如是如是。婆羅門！此婆羅門！愛生\n已則有憂慼苦不樂。」 「云何，瞿曇！豈當爾？愛生＝上【三】生【大】，上【宋】【元】【明】生上\n已，當有憂慼苦不樂耶？此瞿曇！愛生已，當有\n歡喜愛念。」再三，世尊告彼婆羅門曰：「如是如\n是。婆羅門！此婆羅門！愛生已，則有憂慼啼泣\n不樂。」再三，彼婆羅門白世尊曰：「云何，瞿曇！豈\n當爾？愛生已，有憂慼不樂耶？此瞿曇！愛生已，\n但有歡喜愛念。」於是彼婆羅門聞世尊所說，\n亦不樂、不說非。不樂、不然可已，從坐起便還。\n彼時祇桓＝洹【明】＊桓【大】＊，洹【明】＊桓洹門外有諸戲人共戲，彼婆羅門遙\n見祇桓洹門外有諸戲人共戲，見已作是念：「世\n間聰明者此是【CB】【麗-CB】，［－］【大】是K19n0703_p0591b07最勝，我寧可所可共沙門瞿曇\n論者，盡當向彼戲人說之。」於是彼婆羅門便\n\n至彼諸戲人所，到已所可共世尊論者，盡向\n彼戲人說之。如是說已，彼諸戲人報彼婆羅\n門曰：「此婆羅門！豈當爾？愛生已，則有憂慼苦\n不樂耶？此婆羅門！愛生已，當有歡喜愛念。」於\n是彼婆羅門作是念：「此諸戲人語與我等。」迴\n頭已即便去。 彼所論則廣聞，次第徹王宮。王\n波斯匿聞之，沙門瞿曇作是言：「愛生已則有\n憂慼苦不樂。」王波斯匿聞已，告末利夫人曰：\n「此末利！我聞沙門瞿曇作是言：『愛生已，則有\n憂慼苦不樂。』」 「如是如是。大王！愛生已，則有苦\n憂慼不樂。」 「此末利！我聞汝師言，弟子亦爾。汝\n末利！彼沙門瞿曇是汝師，而今汝作是言：\n『愛生已，則有憂慼苦不樂。』」 「此大王！聞我所說\n不信者，便可自往、若遣使。」 於是王波斯匿告\n那梨鴦伽婆羅門曰：「汝那梨鴦伽！往彼沙門\n瞿曇所。到已以我言問訊沙門瞿曇，無量問\n訊，安隱輕舉有力不？作如是言：『此瞿曇！王波\n斯匿無量問訊，安隱輕舉有力不？實沙門瞿\n曇！作是言：「愛生已，則有憂慼苦不樂耶？」』此那\n梨鴦伽！若彼沙門瞿曇作是說，汝當善受持\n誦習之。何以故？彼不虛說。」 彼那梨鴦伽婆羅\n門速受王波斯匿教已，至世尊所，到已共世\n尊面相慰勞，面相慰勞已，却坐一面。彼那梨\n鴦伽婆羅門却坐一面已，白世尊曰：「此瞿曇！\n波斯匿王無量問訊，安隱輕舉有力不？實沙\n門瞿曇作是言：『愛生已，則有憂慼苦不樂耶？』」 「此那梨鴦伽！我還問汝，隨所有力當還報之。\n於那梨鴦伽意云何？或有人母命終，彼母命\n終意狂亂，躶形不著衣隨彼遊行，作如是言：\n\n『我不見母、我不見母。』此婆羅門當知之，愛生\n已則有憂慼苦不樂。如是父兄姊妹若婦命\n終，彼婦命終已則意狂亂，躶形不著衣隨彼\n遊行，作是言：『我不見父及婦。』此婆羅門！當知\n此愛生已則有憂慼苦不樂。此婆羅門！昔有\n一人婦還歸家，彼親屬欲奪與他人，彼婦人\n聞之，親屬欲持我與他人。彼婦人聞已速便\n走還。還至己夫所，到已語彼夫曰：『君當知，我\n親屬欲持我與他人。君所應為者今當為之。』\n於是彼人作極利刀，持彼婦人手還入屋中，\n作如是言：『當共同去，當共同去。』斷彼女人命\n亦自斷命。此婆羅門！當知此愛生已，則有憂\n慼苦不樂。」 於是那梨鴦伽婆羅門聞世尊所\n說，善受持誦習已，從坐起，繞世尊已離世尊，\n還至王波斯匿所。到已白王波斯匿曰：「實爾，\n大王！彼沙門瞿曇作是說：『愛生已，則有憂慼\n苦不樂。』」於是王波斯匿告末利夫人曰：「實爾，\n末利！彼沙門瞿曇作是說：『愛生已，則有憂慼\n苦不樂。』」「是故，大王！我還問王，隨所有力當報\n之。於大王意云何？愛鞞留羅大將不？」 「此末利！\n我愛彼鞞留羅大將。」 「此大王！彼鞞留羅大將，\n是敗壞、是變異，生苦憂慼不樂不？"
    },
    "T36n1739": {
      "sutra_id": "T36n1739",
      "title": "大正新脩大藏經",
      "author": "唐 李通玄撰",
      "volume": "36",
      "number": "1739",
      "juan": "40卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T36/T36n1739.xml",
      "total_chunks": 478,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by CBETA 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，CBETA 提供新式標點 新式標點 夫以有情之本，依智海以為源；含識之流，總\n法身而為體。只為情生智隔、想變體殊，達本\n情亡，知心體合。今此大方廣佛華嚴經者，明\n眾生之本際、示諸佛之果源，其為本也；不可\n以功成，其為源也；不可以行得，功亡本就，行\n盡源成。源本無功，能隨緣自在者，即此毘盧\n遮那也。以本性為光，智隨根應，大悲濟物，以\n此為名。依本如是設其教澤，滂流法界以潤\n含生，於是寄位四天、示形八相，菩提場內示\n蘭若以始成、普光法堂處報身之大宅，普賢\n長子舉果德於藏身、文殊小男創啟蒙於金\n色，以海印之三昧周法界而降靈、用普眼之\n法門示塵中之剎海，依正二報身土交參、因\n果兩門體用相徹，以釋天之寶網影十剎以\n重重、取離垢之摩尼明十身而隱隱，無邊剎\n境自他不隔於毫端、十世古今始終不移於\n當念。其為廣也，以虛空而為量；其為小也，處\n極微而無跡。十方無卷，匪虧於小相之中；纖\n塵不舒，含十方而非礙。恒居智海，分果德於\n五位之門；常住法堂，示進修於九天之上。此\n方如是，十剎同然。聖眾如雲，海會相入。智凡\n不礙，狀多鏡以納眾形；彼此無妨，若千燈而\n共一室。此經總有四十品之勝典，玄開果德\n之法門；百萬億之妙言，咸舉佛華之行海。十\n\n身十會，闡十十之法門；十處十方，啟十通而\n疎十辯。〈出現品〉內，示因果以結始終；給孤獨\n園，利人天而明法界。目連鶖子，隔視聽於對\n顏；六千比丘，啟十明於路上。覺城東際五眾\n咸臻，古佛廟前同登十智，善財發明導首，用\n彰來眾齊然。又成五位法門具德，行其軌範，\n令使啟蒙易達解行無疑，遂信首文殊之前、\n正證妙峯之頂。經過五眾，成一百一十之法\n門；至慈氏之園，結會一生之佛果。返示文殊\n之初友，明以果同因；後入普賢之身，彰體用\n圓極。此經名大方廣佛華嚴經者，大以無方\n為義，方以理智為功，廣即毫剎相含，佛乃體\n用無作，華喻行門可樂、能敷理事之功，嚴即\n依正莊嚴，經即貫穿縫綴。〈世主妙嚴品〉者，菩\n薩示生皆為世主，同臻海會故號妙嚴。品者，\n類會同流、法門均隔為品。此經總有四十品\n之勝典，此品建初，故稱第一。是故言大方廣\n佛華嚴經世主妙嚴品第一。 釋此一部之經總作十門分別： 第一明依教分宗　第二明依宗教別\n　第三明教義差別　第四明成佛同別\n　第五明見佛差別　第六明說教時分\n　第七明淨土權實　第八明攝化境界\n　第九明因果延促　第十明會教始終 第一明依教分宗者，夫如來成道體應真源，\n理事二門一多相徹，智境圓寂何法不周？只\n為器有差殊、軌儀各異，始終漸頓隨根不同，\n設法應宜大小全別，時分因果延促不同，化\n佛本身施詮各異，國土淨穢增減不同，地位\n\n因果自有投分。創學之流未諳教跡，執權成\n實迷不進修。若不咸舉眾宗類其損益，無以\n了其迷滯者矣。今略分十法以辯闡猷，使得\n學者知宗，遷權就實不滯其行，速證菩提。 第一小乘戒經，為情有宗。第二菩薩戒，為情\n有及真俱示為宗。第三般若教，為說空彰實\n為宗。第四《解深密經》，為不空不有為宗。第五\n《楞伽經》，以五法、三自性、八識、二無我為宗。第\n六《維摩經》，以會融染淨二見，現不思議為宗。\n第七《法華經》，會權就實為宗。第八《大集經》，以\n守護正法為宗。第九《涅槃經》，明佛性為宗。第\n十《大方廣佛華嚴經》，即以此經名一切諸佛根\n本智慈，因圓果滿、一多相徹，法界理事自在\n緣起無礙佛乘為宗。已上分宗，皆是承前先\n德所立宗旨。設有小分增減不同，為見解各\n別，大義名目亦多相似。如西域及此方諸德\n各立宗教，後當更明。 第一小乘戒為情有宗者，為如來創為凡夫\n造業處，言是應作、是不應作，說善不善。如此\n立教，未為實有。如此有教，且約凡情虛妄之\n處橫繫諸惡，以教制之，令生人天。是故戒序\n云「若欲生天上，及生人中者，常當護戒足，勿\n令有毀損。」眾生有為作業虛妄非實，未得法\n身智身，非為實有宗，且為情有宗。於小乘中\n為軌持教也。如《華嚴經》持戒即不然，經云「身\n是梵行耶？身業四威儀，乃至佛法僧，十眾七\n遮、和尚羯摩壇頭等是梵行耶？如是諦觀求\n梵行者，了不可得。」是故名為清淨梵行者，如\n〈梵行品〉說「如是清淨行者，名持佛性戒，得佛\n\n法身故。乃至初發心時便成正覺，以持佛性\n戒，"
    },
    "T24n1488": {
      "sutra_id": "T24n1488",
      "title": "大正新脩大藏經",
      "author": "北涼 曇無讖譯",
      "volume": "24",
      "number": "1488",
      "juan": "7卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T24/T24n1488.xml",
      "total_chunks": 90,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Gaya Foundation, Text as provided by Anonymous from USA, Punctuated text as provided by Po-Luo, Re-proofing punctuated text as provided by Mr. Zhang Ge-Feng 蕭鎮國大德提供，伽耶山基金會提供，北美某大德提供，波羅大德提供新式標點，張革豐大德提供新式標點重校 新式標點 如是我聞： 一時，佛在舍衛國祇樹＝祇陀【三】【宮】祇樹【大】，祇陀【宋】【元】【明】【宮】祇樹祇陀林中阿那\n邠坻精舍，與大比丘僧千二百五十人，五百\n比丘尼，千優婆塞，五百乞兒。 爾時，會中有長\n者子名曰善生，白佛言：「世尊！外道六師常演\n說法，教眾生言：『若能晨朝敬禮六方，則得增\n長命之與財。何以故？東方之土屬于帝釋，有\n\n供養者，釋提桓因則為護助。南方之土屬閻羅\n王，有供養者，彼閻羅王則為護助。西方之土\n屬婆樓＝婁【三】【宮】樓【大】，婁【宋】【元】【明】【宮】樓婁那天，有供養者，彼婆樓那則為護\n助。北方之土屬拘毘羅天，有供養者，彼拘毘\n羅則為護助。下方之土屬于火天，有供養者，\n火〔天〕－【三】【宮】＊天【大】＊，〔－〕【宋】【元】【明】【宮】＊天則為護〔助〕－【三】【宮】助【大】，〔－〕【宋】【元】【明】【宮】助。上方之土屬于風天，有供\n養者，彼亦＝風則【三】【宮】彼亦【大】，風則【宋】【元】【明】【宮】彼亦風則為護。』世尊！佛法之中，頗有如是六\n方不耶？」 「善男子！我佛法中亦有六＝十【元】六【大】，十【元】六十方，所謂\n六波羅蜜。東方則＝即【三】【宮】＊則【大】＊，即【宋】【元】【明】【宮】＊則即是檀波羅蜜。何以故？始\n初出者，為出智慧光因緣故。彼東方者屬眾\n生心，若有眾生能供養彼檀波羅蜜，則為增\n長壽命與財。南方即是尸波羅蜜。何以故？尸\n波羅蜜名之為右，若人供養，亦得增長壽命\n與財。西方即是羼提波羅蜜。何以故？彼西\n方者名之為後，一切惡法棄於後故，若有供\n養，則得增長壽命＝命之【三】【宮】＊壽命【大】＊，命之【宋】【元】【明】【宮】＊壽命命之與財。北方即是毘離＝梨【三】【宮】離【大】，梨【宋】【元】【明】【宮】離梨耶\n波羅蜜。何以故？北方名號勝諸惡法，若人供\n養，則＝亦【三】【宮】則【大】，亦【宋】【元】【明】【宮】則亦得增長壽命命之與財。下方則即是禪波羅\n蜜。何以故？能正觀察三惡道故，若人供養，亦\n得增長命之與財。上方即是般若波羅蜜。何\n以故？上〔方〕－【三】【宮】方【大】，〔－〕【宋】【元】【明】【宮】方者即是無上無上＝生【三】【宮】上【大】，生【宋】【元】【明】【宮】上生故，若有供\n養，則得增長命之與財。善男子！是六方者，屬\n眾生心，非如外道六師所說。」 「如是六方，誰能\n供養？」 「〔善男子〕－【三】【宮】善男子【大】，〔－〕【宋】【元】【明】【宮】善男子！唯有菩薩乃能供養。」 「世尊！\n以何義故名為菩薩？」 佛言：「得菩提故名為菩\n薩；菩提性故名為菩薩。」 「世尊！若言得菩提\n已名為菩薩者，若未供養彼六方時，云何得\n名為菩薩耶？若以性故名菩薩者，誰有此性？\n有此性者則能供養，若無性者，則不能供養！\n\n是故如來不應說言：彼六方者，屬眾生心。」 「善\n男子！非得菩提故名菩薩。何以故？得菩提\n者，名之為佛，未得菩提乃名菩薩；亦非性故\n名菩薩也。 「善男子！一切眾生無菩提性，如諸\n眾生無人、天性，師子、虎、狼、狗犬等性；現在世\n中和合眾善業因緣故，得人、天身，和合不善\n業因緣故，得師子等畜生之身。菩薩亦爾，\n和合眾善業因緣故，發菩提心，故名菩薩。若\n有說言一切眾生有菩薩性者，是義不然。何\n以故？若有性者，則不應修善業因緣供養六\n方。善男子！若有性者，則無初心及退轉心；以\n無量善業因緣故，發菩提心名菩薩性。 「善男\n子！有諸眾生受行外道，不樂外典顛倒說故，\n發菩提心；或有眾生住寂靜處，內善因緣，發\n菩提心；或有眾生觀生死過，發菩提心；或有\n眾生見惡、聞惡，發菩提心；或有眾生深知自\n身貪欲、瞋恚、愚癡、慳嫉，為呵責故，發菩提心；\n或有眾生見諸外道五通神仙，發菩提心；或\n有眾生欲知世間〔有〕－【三】【宮】有【大】，〔－〕【宋】【元】【明】【宮】有邊無邊故，發菩提心；或\n有眾生見聞如來不思議故，發菩提心；或有\n眾生生憐愍故，發菩提心；或有眾生愛眾生\n故，發菩提心。 「善男子！菩提之心，凡有三種，\n謂下、中、上。若言眾生定有性者，云何說言\n有三"
    },
    "T18n0855": {
      "sutra_id": "T18n0855",
      "title": "大正新脩大藏經",
      "author": "Unknown",
      "volume": "18",
      "number": "855",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T18/T18n0855.xml",
      "total_chunks": 5,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Huang Jian-Lun 蕭鎮國大德提供，北美某大德提供，黃健倫大德提供新式標點 新式標點 先瑜伽者，常可住本尊觀，行步觀想踐蓮華\n而住，次至精舍門而彈指三稱吽，右目觀\n摩字、左目觀吒字，摩日吒月，入戶而顧\n視，是成五利益：所謂諸佛歡喜一、去垢二、光顯\n三、辟除四、結界五。 次左手作金剛拳當心，竪風\n輪，右手亦如是，頂上左右旋轉，指上方及\n下界，皆誦吽字明。 次三匝禮佛。 次陳懺\n悔語「我從過去世」云云。 次著座亦禮佛。 次淨三葉＝業ィ【原】業【CB】【校異-原】，葉【大】業葉業虛心合掌\n加字，三業印四所，並三部被甲等，同結用。 次加持香水灑淨用三股印。 次\n神分諷誦。 次啟加護志敬白「十【CB】，上【大】十上方三世佛」云云，如儀軌註。 次驚＝警ヵ【原】驚【大】，警【考偽-原】驚警\n覺佛印火輪【CB】，輸【大】輪輸印同金剛界。 次唱禮九方便如文，若有心\n散亂者誦大乘經典。 次四無量如常。 次勝心\n真言用金剛合掌。 次金剛輪如常。 次地界。 次四\n方界。 次身隨所應坐，心中觀初字輪圍\n九重虛圓白。 次入佛三昧耶印額、右肩、左肩、心、喉，三轉面門。 次\n法界生火輪印如軌。 次轉法輪印風輪印也，額上三順轉\n印五處，想轉法輪三千界。 次擐甲作印已，右風端想\n唵字，左風端想【CB】，［－］【大】想［－］【CB】，想【大】想砧字，至心上三纏，背後同纏。臍三、右胯一、膝一，左亦同。臍三、腰背三、心嬭、左右肩各一、\n\n喉一、頸後一、額三、腦後三、右左耳上作結髮之勢。 次住入定觀號髻明珠，以鮮白\n羅字置於頂上，罪垢除滅福慧圓滿。 次\n無能堪忍明印虛心合掌，散舒二水，逆順三轉，加持四處。 次驚發地神\n印真言如軌。 次地神持。 次第真言如軌。 次作壇真言\n如來拳印三轉加持壇。 次灑淨真言印如軌。 次白地神偈捧香\n爐誦偈「諸佛慈愍等」云云。 次請地天鉢印，風隨言三招。 次持地真\n言印如軌。 次悲生曼荼羅結跏趺座，現前去一肘之間，白蓮華之上觀字，\n智火燒諸煩惱，及器共清淨。 次安立五字。 次觀首中百光遍\n照。 次心置無生句。 次胸表離染字。 次安立無垢眼謂二目觀字也。 次作火輪印安心三轉，次仰\n印轉空三，即捨印身前。 次作地輪印，誦言置兩膝間，水火風\n空，如次置各所地水印前向下，火風空前向上，印相如常。 次金剛合\n掌當心，誦滿足句五字也。 次安立器世間，想空\n輪在下界，其量無量也。風火水如次作用印末\n皆向下。 次住定印，觀地輪上字成海，海中＝ィ【原】【大】，【校異-原】\n字成五智杵，其上＝ィ【原】【大】，【校異-原】字成羯磨，羯磨上＝ィ【原】【大】，【校異-原】\n字成八葉蓮華，難陀等二龍王扶蓮華左右。 次大海印真言如軌。 次金剛手持華內縛五股。 次\n大真言王用羯磨印。 次八葉蓮華印在上五輪契中。 次師\n子座印口授加命阿者羅微㘑。 次蓮華臺上有字變成廣\n大宮階，砌具足七寶合成，如軌具觀之。 次\n虛空藏真言。 次大輪壇印小金剛輪印也。 次敷眾色\n及界道印，外縛五服種子云云。　\n　如次白赤黃青黑，信進念定慧，具如釋。然\n後誦五色種子，轉迴印五度成五色，自內出外，如次。 次誦\n曩莫三滿多沒馱南吽，又一轉成金剛杵界道。 次\n住定印，觀其中胎＝臺ヵ【原】胎【大】，臺【考偽-原】胎臺內諸尊種子一一分明安\n布。先想圓光大覺師子座及八葉，座上有普\n\n光淨月輪，噁長字置其中，轉成大日牟尼，\n清淨離諸垢，妙色超三界云云。以八葉曼荼\n羅眷屬自圍繞，八葉月輪中有字，\n變成寶幢、開敷華王、阿彌陀、鼓音佛。四隅淨\n月輪中有暗阿沒瑜字，變成普賢、文殊、觀\n音、彌勒，形色莊嚴，面貌手印幖幟等皆如儀\n軌。一一種子一一尊色，一一形相一一三昧\n耶，如法觀而莫闕。若不堪能者，觀中臺＝ィ【原】【大】，【校異-原】\n字成，放金色光普照三重院。阿字門變成諸\n尊，種子變成諸色相。如是觀了，此界存十三\n會。普光淨月輪正受相應身，以八曼荼羅眷\n屬圍繞等者，正明中臺藏也。 次東遍知印，\n名為第二會。北方觀自在，是為第三會。南置\n金剛手，所謂第四會。依涅唎底方不動如來\n使，風方勝三世，是為第五會。四方四大護，當\n為第六會。初門釋迦文，正是第七會。第三妙\n吉祥，應當第八會。南方除蓋障，則為第九會。\n勝方地藏尊，謂之第十會。龍方虛空藏，第十\n一會也。蘇悉地眷屬，為第十二會。護世威德\n天，名第十三會。次第而分敷中初。 次寶冠舉手\n印外五置"
    },
    "T45n1866": {
      "sutra_id": "T45n1866",
      "title": "大正新脩大藏經",
      "author": "唐 法藏述",
      "volume": "45",
      "number": "1866",
      "juan": "4卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T45/T45n1866.xml",
      "total_chunks": 81,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA 蕭鎮國大德提供，北美某大德提供 原書標點 （今將…門）十八字∞（建立…第十）六十字【甲】（今將…門）十八字【大】∞（建立…第十）六十字【甲】今將開釋如來＝迦佛【甲】【乙】如來【大】，迦佛【甲】【乙】如來迦佛海印三昧一乘教義略作\n十門。 （今將…門）十八字∞（建立…第十）六十字【甲】（建立…第十）六十字【大】∞（今將…門）十八字【甲】建立一乘第一＝乘一【甲】【乙】一乘第一【大】，乘一【甲】【乙】一乘第一乘一　教義攝益〔第〕－【甲】【乙】＊第【大】＊，〔－〕【甲】【乙】＊第二\n　（敘）＋古【甲】【乙】古【大】，敘古【甲】【乙】古敘古今立教第三　分教開宗第四\n　乘教開合第五　起教＝教起【甲】【乙】起教【大】，教起【甲】【乙】起教教起前後第六\n　決擇其意第七　施設異相第八\n　所詮差別∞義理分齊【甲】【乙】所詮差別【大】∞義理分齊【甲】【乙】所詮差別義理分齊第九　所詮差別∞義理分齊【甲】【乙】義理分齊【大】∞所詮差別【甲】【乙】義理分齊所詮差別第十 前行甲本乙本有品題建立乘第一五字初明建立〔一〕－【甲】一【大】，〔－〕【甲】一乘者。然此一乘教義分齊。開\n為二門。一別教。二同教。初中＋（亦）【甲】【乙】中【大】，中亦【甲】【乙】中中亦二。一＋（是）【甲】【乙】一【大】，一是【甲】【乙】一一是性海\n果分。（當）＋是【甲】【乙】是【大】，當是【甲】【乙】是當是不可說義。何以故。不與教相應\n故。則＝即【甲】【乙】＊則【大】＊，即【甲】【乙】＊則即十佛自境界也。故地論云。因分可說\n果分不可說者是也。二＋（是）【甲】【乙】二【大】，二是【甲】【乙】二二是緣起因分。則即普賢\n境界也。此二無二全體遍收。其猶波水。思\n之可見。就普賢門＋（中）【甲】【乙】門【大】，門中【甲】【乙】門門中復作二門。一分相門。\n二該攝門。分相門者。此〔則〕－【甲】【乙】則【大】，〔－〕【甲】【乙】則別教一乘別於＋（彼）【甲】【乙】於【大】，於彼【甲】【乙】於於彼\n三乘。如法華中宅內所指門外三車誘引諸\n子令得出者。是三乘教也。界外露地所授＋（大白）【甲】【乙】授【大】，授大白【甲】【乙】授授大白\n牛車是一乘教也。然此一乘三乘差別。諸聖\n教中略有十說。一權實差別。以三中牛車亦\n同羊鹿。權引諸子務令得出。是故臨門三\n車。俱是開方便門。四衢〔道中〕－【甲】【乙】道中【大】，〔－〕【甲】【乙】道中別授大白牛\n車。方為示真實相。若彼三中牛〔車〕－【甲】【乙】＊車【大】＊，〔－〕【甲】【乙】＊車。亦是實\n者。長者宅內引諸子時。指彼牛車秪＝只【甲】【乙】秪【大】，只【甲】【乙】秪只在\n門外。此應亦出即得見（牛）＋車【甲】【乙】車【大】，牛車【甲】【乙】車牛車。如何出竟至本\n\n所指車所住處而不得故。後＝復【甲】【乙】後【大】，復【甲】【乙】後復更索耶。亦不\n可說界外索車但是二乘。以經不說彼求\n牛車人。出門即得彼牛車故。又不說彼\n索先許車唯二乘故。是故經中諸子得出\n至露地已。各白父言。父先所許玩好之具。\n羊車鹿車牛車願時賜與。以此得知三車同\n索。此中三車約彼三乘所求果說。以是元\n意所標趣故。〔問二乘…無〕四十六字－【甲】【乙】（問二乘…無）四十六字【大】，〔－〕【甲】【乙】問二乘各得小果。何以界外\n更索耶。答依小乘。云有教有行果。今依大\n乘。云昔日但有言教無實行果故。故云三\n車空無。若望自宗並皆得果。若不得者如\n何出世。今言俱不得者。以望一乘故。是故\n以實映權則方便相盡。故皆無得也。為欲\n迴彼三〔乘〕－【甲】【乙】乘【大】，〔－〕【甲】【乙】乘人入一乘故。是故大乘亦說迴\n也。若不爾者。彼求牛車人既出界外不\n同凡夫。非求羊鹿不同二乘。未得露地\n大白牛車不同一乘。若非〔彼〕－【甲】【乙】彼【大】，〔－〕【甲】【乙】彼三中大乘＋（人者）【甲】【乙】乘【大】，乘人者【甲】【乙】乘乘人者。\n更是何色人也。以至自位究竟處故。後皆\n進入別教一乘。問臨門三車為實（為）＋不【甲】【乙】不【大】，為不【甲】【乙】不為不實耶。\n答實不實。何以故。是方便故。由是方便引\n子得出非不實。由是方便引故非是實。此\n二無二唯一相也。二教義差別。以臨門牛車\n亦同羊鹿。但有其名。以望一乘俱是教\n故。是故經云。以佛教門出三界苦。亦不可\n說以佛教言但約二乘。以經＋（文）【甲】【乙】經【大】，經文【甲】【乙】經經文不揀＝簡【甲】【乙】＊揀【大】＊，簡【甲】【乙】＊揀簡故。彼\n求牛車人尋教至義。亦同二乘俱不得\n故＋（也）【甲】【乙】故【大"
    },
    "T19n0982": {
      "sutra_id": "T19n0982",
      "title": "大正新脩大藏經",
      "author": "唐 不空譯",
      "volume": "19",
      "number": "982",
      "juan": "3卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T19/T19n0982.xml",
      "total_chunks": 62,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA, Punctuated text as provided by Ms. Chen Hui-Zhen 蕭鎮國大德提供，北美某大德提供，陳惠珍大德提供新式標點 新式標點 《佛母大孔雀明王經》者，牟尼大仙之靈言也，\n總持真句、悲救要門，綰悉地之玄宗、息波瀾\n之苦海。二十八部之神眾，同誓護於斯經，羅\n剎吞毒之都軍，發慈心而警衛，藥叉大將數\n窮百姟，動石擎山，散支為首，捧香花於舍衛，\n起淨念於祇林，禮明行之牟尼，忻所談之深\n法，樂飡禪悅，希甘露以洗心。佛乃悲愍將來，\n託莎底而演教，自陳因地，為彼鳥王，被羂網\n羅，命如懸露。忽思古聖，無上覺皇，演陀羅尼，\n能超眾苦，發聲應念，繫縛氷銷，適樂青空，翔\n騰自在，迄於成佛，詶彼曩因，逝多林中，述斯\n密教。咨嗟末代，蠢蠢含靈，去聖遠遙，運生\n像季，多逢留難，異種魔生，修行者被惑情迷，\n居家者眾邪為患，妖祇祳怪，常現災祥，若不\n此經，何威能制？是以多聞慶喜，親奉聖言，結\n集貝多，周傳沙界。然此支那數朝翻譯，民雖\n遭難，尚未遍宣，即蓋緣往時譯者詞質而文\n梗，潤文者闕方便之妙言，雖聖旨不乖，尋讀\n者引肩而翥目。今所譯者，即中天竺國三藏\n國師和尚不空，善唐梵之言，窮五天之教，來\n於此國，勅令於大明宮，乃譯此經，勒成三卷，\n題云「佛母大金曜孔雀明王經」矣，莫不廣開\n佛日，高照重昏，祕密真詮，遍流同益，靈符既\n顯，萬障自袪，法藥普施，業患永滅。願此法燈\n常耀，總法界而清安，聖壽千春，保金枝而長\n\n茂，天龍警護，法化恒宣，佛勅流暉，塵劫不\n朽。 自此經至代耳之註文宋元明丙四本俱在於啟請法次下，cf. P. 416 [77]. [17] 丙本冠註曰，和本無此經已下至代耳之註文，此是後人取義淨本中注夾于茲耳此經須知大例，若是尋常字體傍加口者，即須彈舌\n道＝呼【三】【丙】道【大】，呼【宋】【元】【明】【丙】道呼之，但為此方無字故借音耳；餘自准＝唯【三】【丙】准【大】，唯【宋】【元】【明】【丙】准唯可依字直說，\n不得漫有聲勢，致使＝失【三】【丙】使【大】，失【宋】【元】【明】【丙】使失本音即＋（喚）【三】【丙】即【大】，即喚【宋】【元】【明】【丙】即即喚便乖梵韻。又讀誦時，聲\n合＝含【三】【丙】合【大】，含【宋】【元】【明】【丙】合含長短，字有輕重，看注四聲而讀，終須師授方能愜\n當。又須粗識字義呼之＝召【三】【丙】之【大】，召【宋】【元】【明】【丙】之召，始可隨情。若至我某甲處，咸\n須具述所求之事。然此經有大神力，求者皆驗，五天之\n地，南海十洲，及北方吐＝土【三】【丙】吐【大】，土【宋】【元】【明】【丙】吐土貨羅等二十餘國，無問道俗，\n有小乘大乘〔者〕－【三】【丙】者【大】，〔－〕【宋】【元】【明】【丙】者，皆共遵敬讀誦求請，咸蒙福利，交報\n不虛。但為舊經譯文有闕，致使神洲不多流布，雖遭厄\n難，讀誦者尚稀。故今綜尋諸部梵本，勘會＝令【三】【丙】會【大】，令【宋】【元】【明】【丙】會令委的，更重\n詳審，譯成三卷，并畫像壇場軌式，利益無邊，傳之永【CB】，求【大】永T19n0985_p0459c04求\n代耳。 南謨…徧智者 Namo buddhāya, namo dharmāya, namaḥ saṁghāya, namaḥ saptanī-samyak-saṁbuddhāya.南謨母馱野南謨達磨野南謨僧伽野南謨七佛正遍知者 Namo buddhāya, namo dharmāya, namaḥ saṁghāya, namaḥ saptanī-samyak-saṁbuddhāya.南謨母馱野　南謨達磨野　南謨僧伽野\n　南謨七佛正遍知者Namo buddhāya, namo dharmāya, namaḥ saṁghāya, namaḥ saptanī-samyak-saṁbuddhāya. 南謨慈氏菩薩等一切菩薩摩訶薩，南無獨\n覺聲聞，四向四果＝四果四向【三】四向四果【大】，四果四向【宋】【元】【明】四向四果四果四向，我皆敬禮如是等聖眾。我\n今讀誦摩訶…經。Mahāmayūrī vidyārājñī.摩訶…經 Mahāmayūrī vidyārājñī.《摩訶摩瑜利佛母明王經Mahāmayūrī vidyārājñī.》，我所求請\n願皆如意。所有一切諸天靈祇，或居地上，或\n處虛空，或住於水，異類鬼神，所謂：諸天及龍、\nasura.asura.阿蘇羅、maruta.maruta.摩嚕多、garuḍa.garuḍa.蘖嚕拏、"
    },
    "T21n1343": {
      "sutra_id": "T21n1343",
      "title": "大正新脩大藏經",
      "author": "北齊 萬天懿譯",
      "volume": "21",
      "number": "1343",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T21/T21n1343.xml",
      "total_chunks": 10,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，北美某大德提供，李明芳大德提供新式標點 新式標點 如是我聞： 一時佛在舍衛國祇樹給孤獨園，\n與大比丘千二百五十人＋（俱）【三】人【大】，人俱【宋】【元】【明】人人俱；菩薩摩訶薩萬二\n千人，悉是一生補處，從餘世界而來集會，得\n陀羅尼具無盡辯，成就念慧具足慚愧，於諸\n佛法無有障礙，為諸眾生不請之友，親近教\n化成就善法，於諸佛剎往來無礙，隨眾生心\n以眾善法而教化之，離於一切魔業境界，滅\n除一切煩惱怨賊，善能普入一切法界，善能\n供養一切諸佛，善能安住一切諸禪解脫三\n昧，又能隨意自在入出，其名曰：甘露鼓菩薩\n摩訶薩、甘露稱菩薩摩訶薩、甘露光菩薩摩\n訶薩、甘露名菩薩摩訶薩、甘露響菩薩摩訶\n薩、娑羅樹王菩薩摩訶薩、一切妙＝智【三】妙【大】，智【宋】【元】【明】妙智音菩薩\n摩訶薩、一切智相菩薩摩訶薩、稱相菩薩\n摩訶薩、甘露入菩薩摩訶薩、普慧菩薩摩\n訶薩、普增上菩薩摩訶薩、普光菩薩摩訶\n薩、普稱菩薩摩訶薩、普相菩薩摩訶薩、普\n\n王菩薩摩訶薩、普德相自在王菩薩摩訶薩、\n微妙聲菩薩摩訶薩、勝相菩薩摩訶薩、無\n能勝菩薩摩訶薩、普眼菩薩摩訶薩、普見\n德菩薩摩訶薩、現無過惡菩薩摩訶薩、離\n過菩薩摩訶薩、無過惡菩薩摩訶薩、一切眾\n生不請之友菩薩摩訶薩、不捨一切眾生菩\n薩摩訶薩、常樂集一切功德菩薩摩訶薩、善\n上乘菩薩摩訶薩、第一功德名稱菩薩摩訶\n薩，如是等上首菩薩摩訶薩萬二千人。焰摩\n天子等八萬天子俱，兜率陀天子八十億、化\n樂天子九千二百那由他、他化自在天子一\n萬五千那由他，從他化自在天乃至色界無\n量諸天皆來集會。 爾時東方過此九十二佛世界微塵數佛剎，\n有世界名曰無勝，彼中有佛名曰善勝力如\n來。彼有菩薩摩訶薩名曰尊勝，與菩薩大眾\n前後圍遶，於一念頃於彼界沒，忽現此娑婆\n世界，住虛空中。彼一一菩薩放琉璃雲，遍覆\n三千大千世界（而）＋雨【三】雨【大】，而雨【宋】【元】【明】雨而雨閻浮檀金華；一一菩薩各\n雨一佛世界微塵數供具；一一菩薩各雨一\n佛世界微塵數一切水陸所生無量雜華；一\n一菩薩各雨一佛世界微塵數微妙雜香；一\n一菩薩各雨一佛世界微塵數栴檀、沈水、黑堅\n沈水、雲雨雜香；一一菩薩各雨一佛世界微\n塵數七寶雜鬘；一一菩薩各雨一佛世界微\n塵數栴檀香；一一菩薩各雨一佛世界微塵\n數種種上妙天人之衣；一一菩薩各雨一佛\n世界微塵數種種莊嚴雜寶幢幡；一一菩薩\n各出一佛世界微塵數偈讚，皆未曾有讚歎\n\n如來。爾時此娑婆世界所有地獄苦惱眾生\n皆得安樂，一切眾＝畜【三】眾【大】，畜【宋】【元】【明】眾畜生慈心相向，一切餓鬼悉\n皆飽滿，一切眾生離貪瞋癡，不寒不熱、無有\n想欲、不飢不渴，時日清和無有塵霧，時諸眾\n生於色聲香味觸無不適意放逸。諸天悉得\n寂靜。爾時尊勝菩薩摩訶薩即上至阿迦膩＝尼【三】膩【大】，尼【宋】【元】【明】膩尼\n吒天，住於空中而雨諸供具供養如來，雨一\n切華鬘雜香、塗香末＝粖【三】末【大】，粖【宋】【元】【明】末粖香、衣蓋幢幡、種種眾寶、\n妙莊嚴具，雨於一切天宮、龍宮，夜叉、乾闥婆、\n阿修羅、迦樓羅、緊那羅、摩睺羅伽一切宮上，\n及四天王宮乃至三千大千世界悉皆遍滿。 爾時尊勝菩薩摩訶薩從上來下，詣世尊前。\n到已頂禮世尊足，遶無量匝，以天清淨琉璃\n金剛珠網覆如來上，坐於一面。爾時尊勝見\n佛世尊入一真諦法，入是法時能入一切三\n世諸佛所說法門，能知諸佛無量相應辯、解\n脫辯、無礙辯、無著辯、無盡辯、一切處辯、普\n遍辯、一切法如實方便所說辯、空無相無願\n解脫門辯、一切諸禪解脫三昧如實方便分\n別念處明了說辯、正勤起滅說辯、神足往來\n說辯、根力智辯、力無勝辯、菩提覺如實辯、分\n別法界辯、見如實辯、幻化泡焰水中月吼＝呼【三】吼【大】，呼【宋】【元】【明】吼呼聲\n響一切法如實辯、無生無滅如實辯、微細辯、\n種種辯、美妙辯、知眾生心善不善如實辯、一\n切眾中以一音辯、一切法辯。爾時尊勝見如\n是事，即從坐起，整衣服，右膝著地合掌向佛，\n白佛言：「世尊！願賜少空閑，聽我問於如來正\n覺。」爾時世尊告尊勝菩薩：「我常於眾生施於\n空閑。恣汝所問，如來正覺當斷汝疑，悅可汝\n\n意。」爾時尊勝菩薩白佛言：「世尊！有陀羅尼名\n一切法無量如實所說法門。若有菩薩得是\n陀羅尼相應法門者，彼菩薩能得無斷辯、無\n愚辯、一切法作無作辯、知陀羅尼無礙辯、微\n細辯，能持一切諸佛所說、能知無量所說，復\n能入陀羅尼聚智，能"
    },
    "T01n0098": {
      "sutra_id": "T01n0098",
      "title": "大正新脩大藏經",
      "author": "後漢 安世高譯",
      "volume": "1",
      "number": "98",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T01/T01n0098.xml",
      "total_chunks": 7,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Mr. Chang Wen-Ming, Text as provided by Anonymous from USA, Punctuated text as provided by Dhammavassarama 蕭鎮國大德提供，張文明大德提供，北美某大德提供，法雨道場提供新式標點 新式標點 聞如是： 一時，佛在舍衛國祇樹給孤獨園。是\n時，賢者舍利弗＝曰【三】＊弗【大】＊，曰【宋】＊【元】＊【明】＊弗曰，請比丘聽說法，上頭亦善，\n中央＝耍【元】【明】央【大】，耍【元】【明】央耍亦善，要亦善，善解分別具淨除，聽賢\n者行，名具法行，當為聽，善心諦念。比丘應如\n賢者言，從賢者舍利弗曰聽。 賢者舍利弗曰，便說十二時聚會，能致賢者\n道。「何等為十二？一為自能教身，二為亦能教\n餘，三為隨＝墮【三】＊隨【大】＊，墮【宋】＊【元】＊【明】＊隨墮人中，四為隨墮賢者中，五為根足，\n六為不隨墮世間業，七為見賢者喜，八為佛亦\n有，九為亦說法，十為已＝以【三】已【大】，以【宋】【元】【明】已以說法能受，十一為\n能聽外受，十二為如得能依方施。是〔為〕－【三】為【大】，〔－〕【宋】【元】【明】為賢者\n十二時聚會。為得賢者道，從是行。 「若經欲說異人者，當為〔是〕－【三】＊是【大】＊，〔－〕【宋】＊【元】＊【明】＊是二十品說。何等為\n二十？一為善說＋（說）＊說【大】＊，說說【？】＊說說說，二為多說，三為前後說，\n四為次第說，五為歡喜說，六為可說，七\n（當）＋為【三】＊為【大】＊，當為【宋】＊【元】＊【明】＊為當為解意說，八為當為除慚說，九當為莫訶失\n說，十為當為調說，十一為當為應說，十二為當為莫\n散說，十三為當為法說，十四為當為隨眾說，十\n五為當為等意說，十六為當為助護意說，十七為當為\n莫窮名〔聞〕－【三】聞【大】，〔－〕【宋】【元】【明】聞故說，十八為當為莫利事故說，十\n九為當為莫從說自現，二十莫從說調餘。若賢\n者比丘，欲為餘人說，當為是二十品說。」 舍利弗曰復謂比丘：「欲聞法者，當有十六業。\n何等為十六？一當為有時可聞，二當為多聞，\n三當為向耳聽，四當為事，五當為莫平訶＝評諄【三】平訶【大】，評諄【宋】【元】【明】平訶評諄，\n六當為莫訶失，七當為莫求長短，八當為法\n恭敬，九當為說法者恭敬，十當為莫易法，十\n一亦莫易說法者，十二亦莫自易身，十三＋（當）【三】三【大】，三當【宋】【元】【明】三三當一\n向心，十四莫餘意，十五正持心，十六覺一切\n念可聞法正。 「若賢者欲得聞法，當為案是十六行可聞法。\n何等為十六？一為時時可聞法，二為可多聞\n法，三為耳聽可聞法，四為事可聞法，五為不\n得訶可聞法，六為莫求（長）＋短【三】短【大】，長短【宋】【元】【明】短長短可聞法，七為敬法\n可聞法，八為敬說經者可聞法，九為莫易法\n可聞法，十為莫易說法者可聞法，十一為莫\n易自身可聞法，十二為一向＝向一【三】一向【大】，向一【宋】【元】【明】一向向一心可聞法，十三\n為莫有餘意可聞法，十四為正橫意可聞法，\n十五為一切一意可聞法，十六為念定意可\n聞法。 「若賢者欲得聞法，當為案是十六比可聞法。\n已聞法如上說，便生信可意，從是致到無為。\n已聞如是法，便生賢者愛無所欲，最從是致\n無為。已聞如是法，便生喜意愛＝受【三】愛【大】，受【宋】【元】【明】愛受，為從是致\n無為。已聞如是法，便捨惡著意為定意，為從\n是致無為。已聞如是法，得捨疑見復明，為最\n將＝持【三】將【大】，持【宋】【元】【明】將持至無為。已聞如是法，便見陰無所有，便\n見陰空，便見陰輕，以見便意解、便意淨、便意\n止、便意解脫，如是為從是致無為。已聞法如\n是，一切世間行見空，不復往＝住【三】往【大】，住【宋】【元】【明】往住住，便愛盡離\n滅，便可無為意轉意止＝土【元】止【大】，土【元】止土得解脫，為從是致無\n\n為。已聞法如是，意欲行相從行獨坐斷妄，得\n第一願，為從是致無為。已聞如是法，為淨眼\n見四諦，為從是致無為。已聞如是法，為滿\n行，為從是致無為。已聞如是法，賢者道弟子\n為不惱說者，亦從聞得樂，亦不犯教法，亦隨\n安隱，自所求欲滿便，為是＝是為【三】為是【大】，是為【宋】【元】【明】為是是為十法，所從行致。\n何等為十？一為若善知【CB】【麗-CB】，如【大】知K19n0717_p0621b01如識，二為若善戒，三為\n若善同學，四為若知受意，五為若受教，六為\n若問，七為若聞經，八為若聚說經，九為若驚\n怖因緣得驚怖，十為己羞驚怖本觀是時本\n觀。便斷一切惡法，能斷從本觀已能却是法"
    },
    "T23n1442": {
      "sutra_id": "T23n1442",
      "title": "大正新脩大藏經",
      "author": "唐 義淨譯",
      "volume": "23",
      "number": "1442",
      "juan": "50卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T23/T23n1442.xml",
      "total_chunks": 538,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Gaya Foundation, Text as provided by Anonymous from USA, Punctuated text as provided by Ven. Shi Ben-Chan 蕭鎮國大德提供，伽耶山基金會提供，北美某大德提供，釋本禪法師提供新式標點 新式標點 總攝頌曰： 別攝頌曰： 爾時薄伽梵，從初證覺於十二年中，諸聲聞\n弟子無有過失，未生瘡疱。世尊為諸弟子，說\n略別解脫戒經曰： 至十三年，在佛栗氏國，時羯闌＝蘭【三】【宮】＊闌【大】＊，蘭【宋】【元】【明】【宮】＊闌蘭鐸迦村，羯\n闌蘭鐸迦子名蘇陣那，富有資財多諸僕使，金\n銀珍寶穀麥盈溢，所貯貲＝資【三】【宮】貲【大】，資【宋】【元】【明】【宮】貲資貨如毘沙門天王。\n於同類族娶女為妻，歡樂而住。彼於異時，於\n佛法僧深生敬信，歸依三寶受五學處：所謂\n殺生、偷盜、欲邪行、虛誑語及飲諸酒，悉皆遠\n離。由斯敬信日漸增廣，便以正信捨家趣非\n家，剃除鬚髮而披＝被【三】【宮】＊披【大】＊，被【宋】【元】【明】【宮】＊披被法服。既出家已，與諸親屬\n相雜而住，猶如昔日在家無異。爾時具壽蘇\n陣那便自思念：「豈容我於善說法律而為出\n家，應證未證應得未得，與諸親族相雜而住。\n我今宜應捨離親屬，執持衣鉢遊行人間。」作\n是念已，便捨親屬行詣他方。 逢世飢＝饑【明】飢【大】，饑【明】飢饑饉乞食\n難得，父母於子尚不相濟，況餘乞者＝人【三】【宮】者【大】，人【宋】【元】【明】【宮】者人。時蘇\n陣那作是念已：「今我親屬財食殷富，宜應就\n彼羯闌蘭鐸迦村，勸於僧田廣設供養：若、若\n\n粥、或常施食、或請喚食、或八日、十四日、十五\n日食，教諸親屬少興福業為饒益事。」時蘇陣\n那便捨他方，執持衣鉢漸次遊行，遂至羯闌蘭\n鐸迦村，去斯不遠在阿蘭若住小房中。時蘇\n陣那詣親屬所，廣為諸人讚揚佛法僧寶，令＝今【元】【明】令【大】，今【元】【明】令今\n於大眾設諸供養而作饒益。時蘇陣那在阿\n蘭若修杜多行，但三衣糞掃衣，常乞食次第\n乞。時諸親族於日日中，恒以上妙甘美飲食\n施眾僧已，蘇陣那持衣鉢入村中，以次而乞\n到其本舍，既無所獲捨之而出。 蘇陣那母有\n事他行，時有老婢遙見蘇陣那憶識容顏，知\n無所獲疾疾而去。老婢見已詣蘇陣那母處白\n言：「大家知不？長子蘇陣那久離鄉邑，今還故\n居，乞求不獲疾疾而去。」時蘇陣那母作如是\n念：「豈非我子有憶戀耶？情生不樂欲歸於俗，\n不愛沙門被沙門所苦，羞慚厭捨沙門行耶？」\n作是念已遂便＝使【三】【宮】便【大】，使【宋】【元】【明】【宮】便使出村，屆蘇陣那所居之處告\n曰：「蘇陣那！汝有憶戀耶？情生不樂欲歸俗耶？\n不愛沙門被沙門所苦，羞慚厭捨沙門行耶？\n蘇陣那！我家中物及娉時財，汝且聽說，我自\n所有金銀之物積為大聚，兩邊人坐互不相\n見。又汝父財物官印金錢＝銀【宮】錢【大】，銀【宮】錢銀數有百千萬億，況\n復諸餘雜類財貨，汝可還家隨情受樂任為\n福施。」說是語已，時蘇陣那白母言：「我無憶戀\n情有不樂歸還故居，亦無不愛沙門被沙門\n所苦羞慚厭捨。」時蘇陣那母聞是語已，便自\n思念：「非我所堪令其返服，應可別設餘計。」 時\n母還舍告新婦曰：「爾若月期時至可報我知。」\n新婦敬諾，後於異時月期既至，白言：「大家！我\n\n今月期時至，欲何所作？」姑曰：「時過洗＝洒【宮】＊洗【大】＊，洒【宮】＊洗洒浴冠\n眾花鬘，塗以名香著諸瓔珞，嚴身之具咸令\n備盡，如蘇陣那昔在家日，情所樂事皆悉為\n之。」婦既聞已莊飾事周，還至姑所白言：「大家！\n如蘇陣那昔所愛好我已為之，沐浴嚴身著\n諸衣服，若有所作今是其時。」時蘇陣那母遂\n與新婦同車而去，詣蘇陣那所住之處，到已\n下車足步而進。時蘇陣那在小房外遊步經\n行，母既見已告曰：「蘇陣那！如汝所云無有憶\n戀，廣說如上。今汝新婦身淨宜留種子，無令\n財物沒入於官。」時蘇陣那先未制戒不見欲\n過，覩少年婦情生染著，欲火燒心，告其母\n曰：「我豈合耶？」母曰：「為留種子法應如是。」時蘇\n陣那牽故二手，便向屏處脫去法服，遂即再\n三行不淨行。時有有情至求勝行，有解脫性\n趣向涅槃，棄背生死三界五趣無心樂著，以\n最後身從勝妙天來託婦胎。若明慧女人，有\n五種別智異於餘女：一、知男子有欲心；二、知\n時節；三、知從某人得娠；四、知是男；五、知是女。\n若是男者依右脇住，若是女者居在左脇。時\n彼婦人心生歡喜，白其姑曰：「大家知不？我已\n有娠，居在右脇，必定是男，光顯宗胄。」其姑聞\n已心大慶喜，作如是言：「我於昔來情希善子\n紹嗣家門，冀彼長成終懷報德"
    },
    "T43n1834": {
      "sutra_id": "T43n1834",
      "title": "大正新脩大藏經",
      "author": "唐 窺基撰",
      "volume": "43",
      "number": "1834",
      "juan": "2卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T43/T43n1834.xml",
      "total_chunks": 56,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Anonymous from USA, Punctuated text as provided by Vijñapti-Mātratā Text Database which is funded by Chung-Hwa Institute of Buddhist Studies and executed by Dharma Drum Institute of Liberal Arts 蕭鎮國大德提供，北美某大德提供，法鼓文理學院、中華佛學研究所之「唯識典籍數位資料庫」提供新式標點 新式標點 《唯識二十論》者，筏蘇畔徒菩薩之所作也。題\n敘本宗有二十頌，為簡《三十》，因以名焉。昔覺\n愛法師，魏朝創譯，家依三藏，陳代再翻。今我\n和上三藏法師玄奘，校諸梵本，覩先再譯，知\n其莫閑奧理，義多缺謬，不悟聲明，詞甚繁鄙，\n非只一條，難具陳述。所以自古通學開＝聞【甲】，閱？開【大】，聞【甲】，閱【考偽-大】開聞閱而靡\n究，復以大唐龍朔元年，歲次辛酉，六月一日，\n於玉花慶福殿，肇翻此論。基受旨執筆，其月\n八日，詳譯畢功，刪整增訛，綴補紕闕，既覩新\n本，方類世親。聖旨創興於至那，神容重生於\n像季，哲鑒君子，當自詳之。 然此論本，理豐文\n約，西域註釋，數十餘家。根本即有世親弟子\n瞿波論師，末後乃有護法菩薩。護法所造，釋\n名《唯識導論》，印度重為詞義之寶。爰＝悉【甲】爰【大】，悉【甲】爰悉至異道\n甞味研談。我師不以庸愚，命旌厥趣，隨翻受\n旨，編為《述記》。每至盤根錯節＝綜【甲】節【大】，綜【甲】節綜之義，敘宗迴復\n之文，旨義拾＝捨【甲】拾【大】，捨【甲】拾捨釋，以備提訓，更俟他辰，方冀\n翻釋。工＝功【甲】工【大】，功【甲】工功虧化畢，未果便終，遂使玄源見擁而\n無披，幽靈守昏而永翳。可謂連城易託，法寶\n難規＝窺【甲】規【大】，窺【甲】規窺，淺義疎文從茲絕矣。 梵云：「毘若底」此\n\n云識；「摩呾喇多」此云唯；「憑始迦」此云二十；「奢薩呾【CB】，咀【大】呾T43n1831_p0608c24咀羅」此云論；\n順此方言，名《唯識二十論》。「唯」者獨但簡別之\n義；「識」者了別詮辨之義。唯有內心，無心外\n境，立唯識名，至下當釋，識即是唯，故言「唯\n識」，是持業釋；復言「二十」，是頌數名，合名《唯\n識二十論》者，帶數釋也。論如常釋，釋義及\n難，至文當敘。舊論但名《唯識論》者，譯家略\n也。 論：安立大乘三界唯識。 述曰：將釋本文以\n三門辨：一、顯教時機，教攝分齊；二、明論宗體，\n造論所由；三、依論所明，判文別釋。初顯教時\n機教攝分齊者，於中有三：一、辨時；二、辨機；三、\n辨攝。先辨時者，如來說教總有三時，初於鹿\n苑，說阿笈摩，有四諦教，破我有執。次於鷲嶺，\n說大般若，空二取教，破法有執。雖空、有教，能\n離斷常，然未盡理會於中道，後於七處八會，\n方說三界唯心，雙離有、空，契中道教，即是《花\n嚴》、《解深密》等，空心外二取。 破初有執，有內識\n一心，遣後空見，故今此論，正處中道，是第三\n時，勝義教也。如《解深密》、《瑜伽》等說。先時所說\n一時、五時，皆無經教，不可依也，如別章中已\n廣敘說。 次辨機者，有情根性總有五種：謂三\n定性、一不定性、一總無性。於此五中，唯大乘\n定及不定性之所聽受，非餘聲聞、獨覺等性\n之所依信。《成唯識》云「無性有情，不能窮底」、「趣\n寂種姓，不能通達」，所辨教理，無上乘故，說唯\n有一心，無心外境故。舍利弗等，如聾、盲故，如\n成唯識義疏中說。 後教攝者，於三藏中，對法\n藏攝；於二藏內，菩薩藏收；十二分教，論議經\n\n攝；於五乘中，大乘所攝。此等教理，如別章\n說。 第二、明論宗體，造論所由者，於中亦三：一、辨\n論宗；二、辨論體；三、辨造論所由。 初辨宗者，所\n明唯識，唯識為宗，離自所明，更無宗故。 次辨\n體者，體有四種，如餘處說。攝相歸性，真如為\n體；攝境歸識，以心為體；攝假歸實，以聲為\n體。 性、相別論，即有二種： 一、增上緣，許佛說\n法，以佛無漏聲名句等為其教體，佛不說法，\n大定智悲，為其教體。 二、親因緣，隨佛說、不說，\n皆於能聽者，耳、意識上所變聲等，為其教體。\n今論之本，謂即佛經，故出體者，應如經說。然\n造論主唯有說法，為增上緣，令聞者變。總合\n疎、親所緣緣為論，皆以聲、名、句、文為體。《十地\n論》說：說聽俱以二事究竟，一者聲；二善字。此\n下文云：「展轉增上力，二識成決定」，《成唯識》說：\n「法、詞二無礙解，境有差別等」，廣引教理，明此\n體性，如餘處說。 後辨造論所由者，然此無文"
    },
    "T31n1622": {
      "sutra_id": "T31n1622",
      "title": "大正新脩大藏經",
      "author": "陳那菩薩造  唐 義淨譯",
      "volume": "31",
      "number": "1622",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T31/T31n1622.xml",
      "total_chunks": 4,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by SAT, Japan, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，日本 SAT 組織提供，北美某大德提供，李明芳大德提供新式標點 新式標點 論曰：為遮一性、異性非有邊故，大師但依假\n施設事而宣法要，欲令有情方便趣入，如理\n作意、遠離邪宗，永斷煩惱。如是三邊，皆有過\n故，我當開釋。此中取因假設，略有三種：一者\n總聚、二者相續、三者分位差別。言總聚者，謂\n\n於一時有多法聚，隨順世間以一性說，如身\n林等。言相續者，謂於異時因果不絕，以一性\n說，如羯羅羅等位名之為人，芽等轉異名\n之為穀。言分位差別者，謂於一事有其多性，\n異不異時而為建立，如色生位異無常性、有\n見有對、業具性故等。由此三義，密意說有補\n嗢揭羅及證圓寂。然此三義但是假設，不可\n說為一性、異性及總無性，有過失故。此中且\n辨＝辯【三】【宮】＊辨【大】＊，辯【宋】【元】【明】【宮】＊辨辯總聚、有聚無異性言。事唯二種，為當許\n有此二自性，遮其性別，謂於有聚、總聚不\n別，名無異耶？為但無餘，說名無異？此有何\n過？頌曰： 論曰：若許手等自性與身是一名無異者，此\n即於身無別性故，手等更互成無差別，手便\n成足，違世＝此【三】【宮】世【大】，此【宋】【元】【明】【宮】世此間故。或復說彼別別支分非身自\n性，於聚集時說為身者，此即全無總聚自體\n少分可得。為異前義，故置或言。若於別事非\n是總聚自性者，即是自性差別；由別性故，於\n聚集時云何與彼無別自性得成應理？不由\n總聚捨自性故。此復便成多種體性，總聚於\n多無異性故。若別若總是無異性，由非總別\n捨自性故；若頓若漸皆成多性，望彼諸事無\n異性故。如是且辨辯二計過失。頌曰： 論曰：「若言唯遮餘有性，二種非有汝成過」者，\n若於有聚無別總聚名無異者，此即更互相\n\n待成無異性。若於一處有無異義，第二亦爾，\n云何汝得免斯過失？如無總聚，有聚亦無。若\n異此者，無異之言便成無用。若一有性是所\n遮者，縱許如是於他所執有分實事唯遮於\n此名無異者，此亦不然，事無別故。兩處相似\n由無異言，一處既爾，於餘亦然，如初無異言\n故，汝不應但遮一處。若言意許唯遮彼者，應\n可但言無其有分，勿言無異，彼之有性是不\n樂故。若其許彼體性是有不許異者，說無異\n言方成應理。又有異義，非無別故兩相似者，\n如離手等更無別身，是有分故，如是手等亦\n待指等成其有分，手等如身亦成非有。如\n是乃至極微待於聲等，聲等復待薩埵等，薩\n埵等復待喜等。待異＝果【三】【宮】異【大】，果【宋】【元】【明】【宮】異果功能此即分，與有分\n同有分性故，汝所執便成非有。如是且辨辯許\n無異性有二種過。頌曰： 論曰：「異性亦爾」者，有二過言流至於此，由彼\n於自支分轉時，或別別轉、或復遍轉。此中且\n辨辯別別轉義。若以一邊於手等處有分轉\n時，彼亦一邊猶如手等復更應有一邊隨起。\n如是展轉有無窮過。「或非是一」者，異無窮過，\n故置或言。若言身分一邊更不轉者，此即應\n無一有分義，便成有分唯有一邊。若爾，應許\n唯有手等，何煩黨執於己支分有分轉耶？「及\n全無」者，一邊無窮，及更有過，故置及言。以此\n一邊於分轉時，此即全無有分可得，由非有\n分如手足等有其一邊。若言有分離手等時\n\n無別支分，有分體一故。若如是者，便成於彼\n別支分處各各遍轉。唯此二計，更無第三分\n別執故。頌曰： 論曰：若言遍者，所許＝計【三】【宮】許【大】，計【宋】【元】【明】【宮】許計有分與支分量同，於\n一一處皆周＝同【三】【宮】周【大】，同【宋】【元】【明】【宮】周同遍故，彼即便成多種體性。更有\n異義，故置及言。由於一處遍皆有故，由不許\n彼別處性故，及餘支分更互無差，由彼和合\n同一處時事無別故。此則手處應許有足，便\n違世間共許道理。「或此非彼」者，更有異計，故\n置或言。為避前過，云有分體於足轉時，非於\n手等有分別＝則【宮】別【大】，則【宮】別則轉，此則無有於餘支分同處過\n者，此同捺癭反出眼睛。若如是者，一切有分\n成一實事，是故諸事成一極微，由彼有分於\n自支分展轉起時，乃至唯有一實極微住處\n可得。此一支分，便與有分同一極微。此有分\n執理成無用，及違自宗。若言離於色等別有\n極微，即無如前所說之過，由彼不於色等處\n轉故無此失。"
    },
    "T24n1463": {
      "sutra_id": "T24n1463",
      "title": "大正新脩大藏經",
      "author": "失譯",
      "volume": "24",
      "number": "1463",
      "juan": "8卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T24/T24n1463.xml",
      "total_chunks": 109,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Text as provided by Gaya Foundation, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，伽耶山基金會提供，北美某大德提供，李明芳大德提供新式標點 新式標點 問曰：「何故名母經？」 智者說曰：「此經能滅憍慢\n解煩惱縛，能使眾生盡諸苦際畢竟涅槃，故\n名母經。毘尼者，名滅滅諸惡法，故名毘尼。\n今當說母經義。母經義者，能決了定義，不違\n諸經所說，名為母經。此中解二種經：一比丘\n經、二比丘尼經，一切諸聚後當廣說。 「初十人\n制戒因緣增一中義，皆入此經中。因初因緣\n得知初事斷人疑心，眾經中義不復惑也。若\n比丘欲善持毘尼母經中定解，能速除生死\n亦勝犯戒賊。 「受具足義今當說。何故名受具\n足？智慧人受具足已不犯，所求成就，故言受\n具。能成就義名為受具。以是義故，成就眾善\n名為受具。復次能專心持戒，故言受具。能使\n成沙門義，故名受具。能使人成就意淨法故，\n\n名為受具。能成就寂滅法，故名受具。又成就\n比丘法，故名受具。於此律中，知見達解觸證\n得知，名為受具。 「有能成就比丘五種受具，名\n為受具。何者五？一者善來比丘即得受具；二\n者三語即得受具；三者白四羯磨受戒名為\n受具；四者佛勅聽受具即得受具；五者上受\n具。何故名為上＝止【元】上【大】，止【元】上止受具？佛在世時不受戒，直\n在佛邊聽法得阿羅漢，名上受具。是名比丘\n五種受具。比丘尼亦有五種受具：一者隨師\n教而行名為受具；二者白四羯磨而得受具；\n三者遣使現前而得受具；四者善來而得受\n具；五者上受具。能成就不作一切諸惡，是名\n受具。 「又於毘尼藏中選擇是非能信行故，名\n為受具。又能成就斷五蓋法，名為受具。有能\n除覺觀亦名受具，能捨愛著禪心亦名受具，\n苦樂憂喜以能捨故名為受具，能過四空定\n故亦為＝名【三】【宮】為【大】，名【宋】【元】【明】【宮】為名受具，能知諸相滅亦名受具。又受三\n歸五戒亦名受具，又受八齋法亦名受具，又\n受沙彌十戒亦名受具，又分受戒名為受具。\n又能白業觀者亦名受具，成就種性地故名\n為受具。云何名種性地？有人在佛邊聽法，身\n心不懈念念成就，因此心故豁然自悟得須\n陀洹。須陀洹者，善法之種性也。四果四向第\n八地見諦地、薄地、離欲地、已作地，乃至無師獨\n覺，皆名受具。成就六度亦名受具，善語亦名\n受具。從智慧受具乃至善語受具，皆名受具。 「復欲廣說何等人應得受具？若有善男子善\n女人，無障清淨，皆得受具。夫障有三種：業障、\n報障、煩惱障。清淨人者，聽其出家，剃除鬚髮、\n\n著法服，受三自歸十戒，乃至白四羯磨受具。\n當使出家者知四墮法不可犯也，依四依止\n盡形壽受＝壽形受受【三】，壽形受【宮】，形受受【聖】形壽受【大】，壽形受受【宋】【元】【明】，壽形受【宮】，形受受【聖】形壽受壽形受受壽形受形受受行，乃至梵行營事得出家法，得法\n證果受樂，大功德成就。是餘眾事應問和上＝和尚【明】下同和上【大】下同，和尚【明】下同和上和尚\n阿闍梨＝黎【明】＊梨【大】＊，黎【明】＊梨黎。和上阿闍梨黎應教毘尼中所應作\n不應作，又復勸與諸同學同業同行一切善\n法莫相違反＝返【三】【宮】反【大】，返【宋】【元】【明】【宮】反返。 「何故與受具者？欲使得五通樂，\n見苦不怖少欲知＝欲【宮】知【大】，欲【宮】知欲足得大人覺。云何名為得\n於大覺？如佛所受行於毘尼，故名為覺。 「云何名欲？如佛翹勤不惓，故名為欲。又復明\n欲繫念在前，如佛覺無異，以是義故名為欲\n也。何故名觸？得定故名觸；得善得惡亦名為\n觸。云何名證？不放逸故名為證。證言知義，如\n佛覺也。 「此中何者是善來比丘受具？如尊者\n阿若憍陳如。當爾之時世尊遊波羅㮈＝奈【明】㮈【大】，奈【明】㮈奈，尊者\n阿若憍陳如見法得法證法、深解法性，即從\n座起，整衣服偏袒右肩，右膝著地合掌作禮，白\n佛言：『世尊！唯願如來聽我出家修於梵行。』世\n尊告曰：『善來比丘。聽汝於我法中修於梵行\n盡於苦際。』此阿若憍陳如即得出家、即得具\n足。如來言已，身上所著婆羅門服乃至鬚髮\n即皆墮落，沙門法服自然在身，威儀庠＝詳【宮】【聖】庠【大】，詳【宮】【聖】庠詳序手\n執應器，如二十年學法者也。尊者阿鉢祇婆\n犯＝梵【三】【宮】犯【大】，梵【宋】【元】【明】【宮】犯梵、跋提伽、摩訶男等，亦〔如〕－【明】如【大】，〔－〕【明】如阿若憍陳如也。\n耶修陀同侶四人；毘摩羅修婆、侯富那伽、憍\n梵跋提、耶奢童＝僮【聖】童【大】，僮【聖"
    },
    "T32n1651": {
      "sutra_id": "T32n1651",
      "title": "大正新脩大藏經",
      "author": "淨意菩薩造  後魏 菩提流支譯",
      "volume": "32",
      "number": "1651",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T32/T32n1651.xml",
      "total_chunks": 2,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，李明芳大德提供新式標點 新式標點 有弟子＝復第子【宮】有弟子【大】，復第子【宮】有弟子復第子成就，隨所聞法堪能受持，令不忘失\n於如來法，謂事非事及性相等。如是義中心\n懷疑惑，為得知故，問言尊者： 言牟尼者，名為寂滅，亦名無分別，亦名為定，\n亦名無言說。彼牟尼所演、宣暢辯說，是名\n假名＋（說）【三】【宮】假名【大】，假名說【宋】【元】【明】【宮】假名假名說。然彼非是大人丈夫自在定時性相\n所生，但唯因緣所生成故。彼十二分，於煩惱、\n業及以苦處，三法迭互共作因緣，如拒瓶案。\n如是三處所攝應知。 問曰：何者為煩惱、何者為業、何者為苦，而得\n有此諸因緣法勝分攝成？ 答曰：於此十二勝上分中，初為無明、第八為\n愛、第九為取，此三勝分是煩惱所攝；第二\n為行、第十為有，此二勝分是業所攝；餘七\n勝分是苦所攝。此是煩惱、業、苦等三，攝十二\n分應知。言餘七者，謂識、名色、六入、觸、受及生、\n老死。恩愛別離、怨憎合會、所求不得，如是\n等法生一切苦。如是諸分，於向所說，煩惱業\n\n苦以為根本。應知攝十二分唯有三事，更\n無餘法。一切經中但有此分，更無有餘。 問曰：已知此等諸勝分義，為我解釋煩惱業\n苦在於何處？復云何成一切諸事？ 答曰：從三\n生二，三是煩惱，二＋（者）【三】【宮】二【大】，二者【宋】【元】【明】【宮】二二者是業，謂從煩惱而生於\n業。從二生七，七者（（是苦…惱））二十三字＝（（謂苦從七生三））六字【三】【宮】（是苦…惱）二十三字【大】，謂苦從七生三【宋】【元】【明】【宮】是苦，謂從於業而生於\n苦。從七生三者，謂從於苦而生煩惱謂苦從七生三。此說煩\n惱、業、苦三種迭互相生，是故生有輪轉不定。\n所言有者，所謂欲、色、無色界等，彼中不住，喻\n如輪轉。以彼有故，一切世間凡夫眾生，次第\n上下，猶如輪轉，有中〔不定以〕－【三】【宮】不定以【大】，〔－〕【宋】【元】【明】【宮】不定。以不定故，說有\n三處。 問曰：彼造一切身自在眾生，何者是彼？作事\n云何？ 答曰：偈言「一切世間法，唯因果無人，除假說\n故有，此是正思量。」彼非說性，是故見作眾生\n不成。 問曰：若如是者，云何得從現在世間而取未\n來世間？ 答曰：乃至無有一毫等法從現在世間而取\n未來世間。是故偈言「但從諸空法，唯生於空\n法。」此明自我、我所空，謂煩惱業處此五法行，\n性離無我。應如是取。 問曰：若性無我法中而行性無我者，今說何\n為證？ 答曰：偈言「誦燈印鏡響，日珠種子水。」如是等\n諸喻，為證可取。信無自體，性假名故。有言：\n現在世、未來世者，如師所誦，實不從師轉至\n弟子。雖不從師轉至弟子，豈可不成授弟子\n\n義？可言弟子無因而得，遮護妄計無因患故。\n如是臨命終時，心識不至未來世間，防常患\n故。非未來身從餘處來，遮護妄計無因患故。\n如師誦為因，令弟子得，彼不可說以為即是\n亦不可說為一向異。如是臨命終時，心識為\n因，是故得生後身心識。〔而彼心識〕－【明】而彼心識【大】，〔－〕【明】而彼心識，不可說\n一、不可說異，亦不離彼、亦不即彼。如是從燈\n生燈、從印生印、從鏡生（有）＋像【三】【宮】像【大】，有像【宋】【元】【明】【宮】像有像、從聲有響，從日\n從珠出生〔於〕－【三】【宮】於【大】，〔－〕【宋】【元】【明】【宮】於火、從子生芽、如安石榴菴羅果\n等口生涎水。如是等法，不名即彼、不名異\n彼。如是一切諸因緣法轉不轉事，諸有智者\n善思量應知。是中陰者，所謂說色、受、想、行、識。\n彼託生者，此諸陰滅，因彼滅陰後相似生，然\n實無有一毫等法從此至彼。此是世間漸次\n之義。以是義故，一切世間無常、不淨、苦、無我\n等。以能觀察如是事故，於諸法中不生疑惑，\n不疑惑故則不生染，不生染故則不生著，不\n生著故則不虛渴，不虛渴故則不造業，以無\n業故則不取事，不取事故不造有為行，無有\n為行故則不復生，以不生故〔無有〕－【三】【宮】無有【大】，〔－〕【宋】【元】【明】【宮】無有一切身\n心等＝業【三】【宮】等【大】，業【宋】【元】【明】【宮】等業苦。如是不造五種因故，〔則〕－【三】【宮】則【大】，〔－〕【宋】【元】【明】【宮】則於彼處無\n七種果，以無果故名為解脫。如是作故，"
    },
    "T30n1580": {
      "sutra_id": "T30n1580",
      "title": "大正新脩大藏經",
      "author": "最勝子等造  唐 玄奘譯",
      "volume": "30",
      "number": "1580",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T30/T30n1580.xml",
      "total_chunks": 9,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Mr. Li Ming-Fang 維習安大德提供之高麗藏 CD 經文，維習安大德提供，北美某大德提供，李明芳大德提供新式標點 新式標點 本地分中五識相應地之一 今說此論所為云何？謂有二緣故說此論：一、\n為如來無上法教久住世故；二、為平等利益\n安樂諸有情故。復有二緣故說此論：一、為如\n來甘露聖教已隱沒者，憶念採集重開顯故；\n未隱沒者，問答決擇倍興盛故。二、為一切有\n情界中有種姓＝種性【明】種姓【大】，種性【明】種姓種性者，各依自乘修出世善得三\n乘果，出生死故；無種姓者，依人天乘修世間\n善得人天果，脫惡趣故。復有二緣故說此論：\n一者或有於多說空不了義經，如言計著，撥\n無一切、憎背有教，為令隨悟諸法有相，解經\n\n密意捨無見故。二者復有於多說有不了義\n經，如言計著，執有一切、厭怖空教，為令隨悟\n諸法無相，解經密意，捨有見故。復有二緣故\n說此論：一為成就菩薩種姓補特伽羅。唯依\n大教，遍於諸乘文義行果，生巧便智，斷一切\n障、修一切善，證佛菩提，窮未來際自他利樂\n無休廢故。二為成就二乘種姓及無種姓【CB】【麗-CB】，性【大】姓K16n0575_p0220b15性補\n特伽羅。亦依大教，各於自乘文義行果，生巧\n便智，斷煩惱障、伏諸蓋纏，修自分善、得自乘\n果，出離三界諸惡趣故。復有二緣故說此論：\n一者或有宿習無知猶豫顛倒，執着外道小\n乘邪教，故於大乘不能信解，為善分別大乘\n法相，令其信解了達決定，離顛倒故。二者復\n有聞諸契經種種意趣甚深難解，其心迷亂\n誹毀不信，為善開示令生信解，饒益彼故。復\n有二緣故說此論：一為攝益樂略言論勤修\n行者，採集眾經廣要法義略分別故；二為攝\n益樂廣言論勤說法者，於一一法開示無邊\n差別義故。復有二緣故說此論：一為開顯諸\n法實相，問答決擇立正論故；二為滅除一切\n妄執，問答決擇破邪論故。復有二緣故說此\n論：一為顯了遍計所執情有理無，依他起性、\n圓成實性理有情無，令捨增益損減執故；二\n為顯了世間道理、證得勝義法門差別，令修\n二諦無倒解故。復有二緣故說此論：一為開\n闡隨轉、真實二種理門，令知二藏三藏法教\n不相違故；二為開闡因緣唯識無相真如四\n種理門，令修觀行有差別故。復有二緣故說\n此論：一為示現境界差別，令知諸法自性相\n\n狀位差別故；二為示現修行差別，令知三乘\n方便根本果差別故。如是等類所為諸緣，處\n處經論種種異說，當知皆是此論所為。 今說此論所因云何？謂諸有情無始時來，於\n一切法處中實相，無知疑惑顛倒僻執，起諸\n煩惱發有漏業，輪迴五趣受三大苦。如來出\n世，隨其所宜，方便為說種種妙法處中實相，\n令諸有情知一切法，如是如是空故非有、如\n是如是有故非空，了達諸法非空非有，遠離\n疑惑顛倒僻執，隨其種姓起處中行，漸次修\n滿。隨其所應，永滅諸障、得三菩提，證寂滅\n樂。佛涅槃後，魔事紛起，部執競興，多著有\n見。龍猛菩薩證極喜地，採集大乘無相空教\n造《中論》等，究暢真要，除彼有見。聖提婆等諸\n大論師，造《百論》等，弘闡大義。由是眾生，復著\n空見。無著菩薩位登初地，證法光定、得大神\n通，事大慈尊，請說此論，理無不窮、事無不\n盡、文無不釋、義無不詮、疑無不遣、執無不\n破、行無不修、果無不證，正為菩薩，令於諸乘\n境行果等皆得善巧，勤修大行、證大菩提，廣\n為有情常無倒說，兼為餘乘，令依自法修自\n分行、得自果證。如是略說此論所因。 今說《瑜伽師地論》者，名義云何？謂一切乘境、\n行、果等所有諸法皆名瑜伽，一切並有方便\n善巧相應義故。 境瑜伽者，〔謂〕－【三】【宮】謂【大】，〔－〕【宋】【元】【明】【宮】謂一切境無顛\n倒性、不相違性、能隨順性、趣究竟性，與正理\n教行果相應，故名瑜伽。此境瑜伽雖通一\n切，然諸經論就相隨機種種異說，或說諸\n法四種道理名為瑜伽，觀待作用法爾證成，\n\n總攝一切正道理故。或說二十四不相應行\n中一名瑜伽，因果相稱無乖違故。此二並如\n〈決擇分〉等處處廣說。或說雜染清淨無性名\n為瑜伽，除違契順最為勝故，如《大梵問》契經\n等說。諸瑜伽師，觀無少法可令其生及可令\n滅，亦無少法欲令證得及欲現觀，謂於一切\n雜染無性瑜伽中行，觀無少法可令其生及\n可令滅，及於一切清淨無性瑜伽中行，觀無\n少法欲令證得及欲現觀。或說究竟清淨真\n如名為瑜伽，理中最極，一切功德共相應故，\n如"
    },
    "T17n0765": {
      "sutra_id": "T17n0765",
      "title": "大正新脩大藏經",
      "author": "唐 玄奘譯",
      "volume": "17",
      "number": "765",
      "juan": "7卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T17/T17n0765.xml",
      "total_chunks": 49,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Jaero Chen 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，Jaero Chen 提供新式標點 新式標點 吾從世尊聞如是語：「苾芻當知！我觀世間，無\n別一法，覆障群生，馳騁流轉生死長途，如無\n明蓋。所以者何？世間群生，由無明蓋所覆障\n故，馳騁流轉生死長途＝遠【宮】途【大】，遠【宮】途遠。是故汝等應如是\n學：我當云何修起慧明，破無明蓋，出貪愛\n網？汝等苾芻，應如是學。」爾時，世尊重攝此\n義而說頌曰： 吾從世尊聞如是語：「苾芻當知！我觀世間，無\n別一法，繫縛群生，馳騁流轉生死長途，如貪\n\n愛結。所以者何？世間群生，由貪愛結所繫縛\n故，馳騁流轉生死長途。是故汝等應如是學：\n我當云何修瑩慧刀＝力【聖】【聖乙】刀【大】，力【聖】【聖乙】刀力，斷貪愛結，破大闇聚？汝\n等苾芻，應如是學。」爾時，世尊重攝此義而說\n頌曰： 吾從世尊聞如是語：「苾芻當知！若一有情，於\n一劫中流轉生死，所受身骨，假使有能積聚\n不【CB】【麗-CB】，下【大】不K20n0803_p0993b09下爛，其聚高廣，如王舍城毘補羅山。況彼有\n情，無初後際，馳騁流轉生死長途，所受身骨\n而可測量。所以者何？苾芻當知！我說有情，於\n四聖諦不了知故、不照見故、不現觀故、不通\n達故、不審察故，馳騁流轉生死長途，受諸骨\n身。是故汝等應如是學：我當云何於四聖諦，\n了知、照見、現觀、通達、審察、究竟？汝等苾芻，應\n如是學。」爾時，世尊重攝此義而說頌曰： 吾從世尊聞如是語：「苾芻當知！我以佛眼遍\n觀世間，諸有業果皆緣心意。一類有情，心意\n所使，行如是〔行履如是〕－【宋】【宮】行履如是【大】，〔－〕【宋】【宮】行，履如是道；身壞命終，如捨\n重擔，墮諸惡趣，生地獄中。所以者何？彼諸有\n情，心意染污。由此為因，身壞命終，墮諸惡\n趣，生地獄中。」爾時，世尊重攝此義而說頌\n曰： 吾從世尊聞如是語：「苾芻當知！我以佛眼遍\n觀世間，諸有業果皆緣心意。一類有情，心意\n所使，行如是行，履如是道；身壞命終，如捐重\n擔，昇諸善趣，生於天中。所以者何？彼諸有\n情，心意清淨。由此為因，身壞命終，昇諸善\n趣，生＋（於）【聖】【聖乙】生【大】，生於【聖】【聖乙】生生於天〔界〕－【聖】【聖乙】界【大】，〔－〕【聖】【聖乙】界中。」爾時，世尊重攝此義而說頌\n曰： 吾從世尊聞如是語：「苾芻當知！一切有情，皆\n\n由自業，業為伴侶、業為生門、業為眷屬、業為\n依趣；業能分定一切有情下、中、上品。是故汝\n等，應當善知：諸業自性、諸業因緣、諸業品\n類、諸業異熟、諸業盡滅，趣業滅道因緣資\n具。苾芻汝等，如我所說，應正了知。 「云何應知\n諸業自性？業自性者，謂或思業，或思已業＝業已【三】【宮】已業【大】，業已【宋】【元】【明】【宮】已業業已。\n如是應知諸業自性。既正了知業自性已，云\n何應知諸業因緣？業因緣者，謂諸貪愛。如是\n應知諸業因緣。既正了知諸業＋（因緣既正了知諸業）【三】【宮】業【大】，業因緣既正了知諸業【宋】【元】【明】【宮】業業因緣既正了知諸業自性、業因緣\n已，云何應知諸業品類？業品類者，謂＝諸【聖】【聖乙】謂【大】，諸【聖】【聖乙】謂諸別\n品類業，趣地獄身；別品類業，趣傍生身；別品\n類業，趣鬼界身；別品類業，趣阿素洛界身；別\n品類業，趣人界身；別品類業，趣天界身。如\n是應知諸業品類。既正了知諸業自性、諸業\n因緣、業品類已，云何應知諸業異熟？〔業異熟〕－【三】【宮】業異熟【大】，〔－〕【宋】【元】【明】【宮】業異\n熟者，謂於此生造作諸業，即此生中能感\n諸有，或受、未受。如是應知諸業異熟。既正\n了知諸業自性、諸業因緣、諸業品類、業異熟\n已，云何應知諸業盡滅？業盡滅者，謂愛滅\n故諸業盡滅。如是應知諸業盡滅。既正了\n知諸業自性、諸業因緣、諸業品類、諸業異熟、業\n盡滅已，云何應知趣業滅道因緣資具？趣業\n滅道因緣資具者，謂八支聖道，即是正見、正\n思惟、正語、正業、正命、正精進、正念、正定。如是\n應知趣業滅道因緣資具。 「苾芻當知！諸有沙\n門或婆羅門，若能正知諸業自性、諸業因\n緣、諸業品類、諸業異熟、諸業盡滅、趣業滅\n道因緣資具，即能信我法毘奈耶。若能信\n我法毘奈耶，即能入我法毘奈耶。若能入我\n\n法毘奈耶，即能達我法毘奈耶修行梵行。\n若"
    },
    "T14n0515": {
      "sutra_id": "T14n0515",
      "title": "大正新脩大藏經",
      "author": "唐 玄奘譯",
      "volume": "14",
      "number": "515",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T14/T14n0515.xml",
      "total_chunks": 5,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo, Tripitaka Koreana as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Jasmine 蕭鎮國大德提供，維習安大德提供之高麗藏 CD 經文，北美某大德提供，Jasmine 提供新式標點 新式標點 如是我聞： 一時，薄伽梵在室羅筏住誓＝逝【明】誓【大】，逝【明】誓逝多林\n給孤獨園，與其無量大苾芻眾、天人等俱。 爾\n時，憍薩羅主勝軍大王，尊位威德皆悉成就，\n\n為欲瞻仰請問佛故，嚴駕出城往如來所。乘\n至下處步進入園，遙見世尊坐一樹下端嚴\n殊妙，諸根閑寂其心宴＝晏【元】【明】宴【大】，晏【元】【明】宴晏然，已能善得最上\n調順寂止究竟，已能善到第一調順寂止彼\n岸，善能密護降伏諸根，為丈夫龍、丈夫牛王、\n丈夫良馬，清淨無撓如澄泉池，威德熾盛光\n明照曜如大金山，有三十二大丈夫相圓滿\n莊嚴，八十隨好間飾支體。 時，勝軍王遙見佛\n已，心喜踊躍不能自勝，便即脫去剎帝利種\n灌頂大王隨身所有五標尊飾：一者、頂上寶\n冠；二者、所執＝報【聖】＊執【大】＊，報【聖】＊執報神劍；三者、眾寶傘蓋；四者、末\n尼扇拂；五者、織成寶履。既去是已詣如來所，\n到已頂禮世尊雙足，右繞三匝退坐一面。 爾時，勝軍大王坐一面已，而白佛言：「大悲世\n尊！惟＝唯【聖】下同惟【大】下同，唯【聖】下同惟唯願如來哀愍教授，惟願善逝哀愍教\n誡，令我長夜證於大義利益安樂。」 爾時，世尊告大王曰：「善哉，善哉！大王！汝今\n乃能請問如來如是大義。大王！汝今為大國\n主，應以正法勿以邪法，應隨法行勿隨非法。\n所以者何？ 「大王當知！若有國王或諸王等，棄\n捨正法以諸邪法而作國王，彼於現在為諸\n聖賢之所訶毀，後致憂悔，身壞命終墮諸惡\n趣，生地獄中受諸劇苦；又若國王或諸王等，\n棄捨邪法以其正法而作國王，彼於現在為\n眾聖賢之所稱讚，後無憂悔，身壞命終超昇\n善趣，生諸天中受諸妙樂。 「大王！譬如父母憐愍於子，心常欲令離苦\n得樂；王亦應爾，於諸國邑所有眾生，僮僕、\n作使、輔臣、僚佐，應以諸佛所說四攝而授＝攝【三】【宮】【聖】授【大】，攝【宋】【元】【明】【宮】【聖】授攝受\n\n之。何等為四？一者、布施；二者、愛語；三者、利\n行；四者、同事。如是善攝國邑眾生，僮僕、作使、\n輔臣、僚佐，攝於二義同事同歸。何等二義？一\n者、現在；二者、未來。 「大王當知！譬如男子或諸女人，於其夢中夢\n心所見，可愛園林可愛山谷，可愛國邑并諸\n異類，彼夢覺已所見皆無。如是，大王！國祚\n身命虛偽無常，一切皆如夢之所見。 「大王當\n知！王富貴樂、王自在樂、王愛欲樂，及餘所\n受＝愛【三】【宮】＊【聖】受【大】＊，愛【宋】【元】【明】【宮】＊【聖】受愛諸欲樂具，所謂象馬車步諸軍宮殿，后\n妃太子諸王，輔臣僚佐防衛士眾，父母兄弟\n姊妹妻妾，男女大小僮僕作使國邑眾生，金\n銀珍寶末尼真珠，衣服財穀庫藏等物，如是\n所有諸欲樂具，於命終時皆當棄捨，獨往後\n世無一相隨。 「大王當＝常【宋】【元】當【大】，常【宋】【元】當常知！如上所說一切樂具，非常非恒\n不可保信，皆變易法迅速不停，流轉移動終\n歸壞滅，念念遷謝後為灰燼，究竟同趣滅盡\n之門，是失壞法有諸怖畏、有諸災橫、多諸愁\n惱，皆是墜墮零落斷壞離散之法＋（亦復如是）【元】【明】法【大】，法亦復如是【元】【明】法法亦復如是。 「大王當知！譬如樹林先見開華，尋復結果後\n還無果，先見其葉榮茂青翠，尋復萎黃後皆\n凋落。如是，大王！國祚身命，王富貴樂、王自\n在樂、王愛欲樂，及餘所愛＝受【聖】愛【大】，受【聖】愛受諸欲樂具，所謂\n象馬車步軍等，廣說乃至皆是墜墮零落斷\n壞離散之法，亦復如是。 「大王當知！如大火聚，先見熾然復極熾然，轉\n遍熾然後皆洞然，雖久熾盛終歸滅盡。如是，\n大王！國祚身命，王富貴樂、王自在樂、王愛\n\n欲樂，及餘所受愛諸欲樂具，所謂象馬車步\n軍等，廣說乃至皆是墜墮零落斷壞離散之\n法，亦復如是。 「大王當知！如日月輪，有大神用具大勢力，放\n大光明以自莊嚴，遍照世間終歸隱沒。如是，\n大王！國祚身命，王富貴樂、王自在樂、王愛\n欲樂，及餘所受＝愛【三】【宮】＊【聖】受【大】＊，愛【宋】【元】【明】【宮】＊【聖】受愛諸欲樂具，所謂象馬車步\n軍等，廣說乃至皆是墜墮零落斷壞離散之\n法，亦復如是。 「大王當知！譬如大雲遍覆虛空，暴風疾雷掣\n電注雨，震動天地須臾散滅。如是，大王！國\n祚身命，王富貴樂、王自在樂、王愛欲樂，"
    },
    "T02n0112": {
      "sutra_id": "T02n0112",
      "title": "大正新脩大藏經",
      "author": "後漢 安世高譯",
      "volume": "2",
      "number": "112",
      "juan": "1卷",
      "file_path": "/Users/vairocana/Desktop/buddhakorea/buddha-korea-notebook-exp/opennotebook/data/raw/cbeta/T/T02/T02n0112.xml",
      "total_chunks": 1,
      "sample_text": "Available for non-commercial use when distributed with this header intact. Text as provided by Mr. Hsiao Chen-Kuo / proofread twice by Mr. Chang Wen-Ming, Text as provided by Mr. Christian Wittern, Text as provided by Anonymous from USA, Punctuated text as provided by Dhammavassarama 蕭鎮國大德提供／張文明大德二校，維習安大德提供，北美某大德提供，法雨道場提供新式標點 新式標點 聞如是： 一時，佛在舍衛國祇樹給孤獨園。佛\n\n告諸弟子：「聽我說邪道亦說正道。何等為邪\n道？不諦見、不諦念、不諦語、不諦治、不諦求、不諦\n行、不諦意、不諦定。是為道八邪行。 「何等為道八正行？一者諦見。諦見為何等？信\n布施、信禮、信祠、信善惡行自然福、信父母、信天\n下道人、信求道、信諦行、信諦受。今世後世，自\n黠得證自成。便相告說是為諦見。 「第二諦念為何等？所意棄欲、棄家、不瞋恚怒、\n不相侵，〔是〕－【三】是【大】，〔－〕【宋】【元】【明】是為諦念。 「第三諦語為何等？不兩舌、不傳語、不惡罵、不\n妄語，是為諦語。 「第四諦行為何等？不殺盜婬，是為諦行。 「第五諦受為何等？是聞有道弟子法求，不可\n非法，飯食、床臥、病瘦正法求，不可非法，是為\n諦受。 「第六諦治為何等？生死意共合行，所精進行，\n出力因緣行＝得【三】行【大】，得【宋】【元】【明】行得，乃精進不厭意持，是為諦治。 「第七諦意為何等？生死行合意念、向意念，不\n妄不共意求，是名為諦意。 「第八諦定為何等？生死意合，念止、相止、護已\n止、聚止。不可為、不作所有罪，不墮中庭＝避【三】庭【大】，避【宋】【元】【明】庭避。是\n名為諦定。 「比丘！所有道弟子，當受是八種行諦道，如說\n行可得道八行覺。諦見者信布施，後世得具\n福，信禮者見沙門道人作禮福，信祠者懸繒\n燒香散花然燈，信所行十善是為自然得福，\n信父母者信孝順，信天下道人者喜受經，信\n求道者為行道。信諦行者斷惡意，信諦受者\n不犯戒。今世後世，自黠為得黠，能教人得證，\n\n自成者能成人。能成他人，便相告說，是名為\n諦見知。如是便自脫亦脫他人。 「第二諦念所意起者為失意，欲棄家者為念\n道，不瞋恚怒者為忍辱，不相侵者當正意。 「第三諦語者，不惡罵不犯口四過，但說至誠\n道品諦要。 「第四諦行者，不殺盜婬而行誠信。 「第五〔諦〕－【三】＊諦【大】＊，〔－〕【宋】＊【元】＊【明】＊諦不墮貪者，但求一衣一食為賤醫＝賢【三】醫【大】，賢【宋】【元】【明】醫賢。 「第六諦治者為向三十七品經。 「第七諦意者日增三十七品經，不離意。 「第八諦止者不忘＝妄【三】忘【大】，妄【宋】【元】【明】忘妄因緣，止者常還意護，已\n止者一切無所犯，聚止者得福道。」 佛說如是。\n皆歡喜受。"
    }
  }
}